#ifndef __EPON_MAC_REGS_H__
#define __EPON_MAC_REGS_H__

#include <linux/mtd/rt_flash.h>
#include "common/drv_types.h"

#ifdef UINT32
#undef UINT32
#endif
#ifdef UINT16
#undef UINT16
#endif
#ifdef UINT8
#undef UINT8
#endif

#ifdef __cplusplus
extern "C" {
#endif

#ifndef REG_BASE_C_MODULE
// ----------------- EPON_MAC Bit Field Definitions -------------------


typedef union
{
    struct
    {
#ifdef __BIG_ENDIAN
        FIELD rsv_23                    : 9;
        FIELD mpcp_fwd                  : 1;
        FIELD bcst_llid_m1_drop         : 1;
        FIELD bcst_llid_m0_drop         : 1;
        FIELD mcst_llid_drop            : 1;
        FIELD all_unicast_llid_pkt_fwd  : 1;
        FIELD fcs_err_fwd               : 1;
        FIELD llid_crc8_err_fwd         : 1;
        FIELD rsv_12                    : 4;
        FIELD phy_pwr_down              : 1;
        FIELD rx_nml_gate_fwd           : 1;
        FIELD rxmbi_stop                : 1;
        FIELD txmbi_stop                : 1;
        FIELD chk_all_gnt_mode          : 1;
        FIELD loc_cnt_sync_method       : 1;
        FIELD tx_default_rpt            : 1;
        FIELD epon_mac_sw_rst           : 1;
        FIELD epon_oam_cal_in_eth       : 1;
        FIELD epon_mac_lpbk_en          : 1;
        FIELD rpt_txpri_ctrl            : 1;
        FIELD mode_sel                  : 1;
#else
        FIELD mode_sel                  : 1;
        FIELD rpt_txpri_ctrl            : 1;
        FIELD epon_mac_lpbk_en          : 1;
        FIELD epon_oam_cal_in_eth       : 1;
        FIELD epon_mac_sw_rst           : 1;
        FIELD tx_default_rpt            : 1;
        FIELD loc_cnt_sync_method       : 1;
        FIELD chk_all_gnt_mode          : 1;
        FIELD txmbi_stop                : 1;
        FIELD rxmbi_stop                : 1;
        FIELD rx_nml_gate_fwd           : 1;
        FIELD phy_pwr_down              : 1;
        FIELD rsv_12                    : 4;
        FIELD llid_crc8_err_fwd         : 1;
        FIELD fcs_err_fwd               : 1;
        FIELD all_unicast_llid_pkt_fwd  : 1;
        FIELD mcst_llid_drop            : 1;
        FIELD bcst_llid_m0_drop         : 1;
        FIELD bcst_llid_m1_drop         : 1;
        FIELD mpcp_fwd                  : 1;
        FIELD rsv_23                    : 9;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_e_glb_cfg, *PREG_e_glb_cfg;

typedef union
{
    struct
    {
#ifdef __BIG_ENDIAN
        FIELD rsv_16                    : 16;
        FIELD rpt_overintvl_int         : 1;
        FIELD mpcp_timeout_int          : 1;
        FIELD timedrft_int              : 1;
        FIELD tod_1pps_int              : 1;
        FIELD tod_updt_int              : 1;
        FIELD ptp_msg_tx_int            : 1;
        FIELD gnt_buf_ovrrun_int        : 1;
        FIELD llid7_rcv_rgst_int        : 1;
        FIELD llid6_rcv_rgst_int        : 1;
        FIELD llid5_rcv_rgst_int        : 1;
        FIELD llid4_rcv_rgst_int        : 1;
        FIELD llid3_rcv_rgst_int        : 1;
        FIELD llid2_rcv_rgst_int        : 1;
        FIELD llid1_rcv_rgst_int        : 1;
        FIELD llid0_rcv_rgst_int        : 1;
        FIELD rcv_dscvry_gate_int       : 1;
#else
        FIELD rcv_dscvry_gate_int       : 1;
        FIELD llid0_rcv_rgst_int        : 1;
        FIELD llid1_rcv_rgst_int        : 1;
        FIELD llid2_rcv_rgst_int        : 1;
        FIELD llid3_rcv_rgst_int        : 1;
        FIELD llid4_rcv_rgst_int        : 1;
        FIELD llid5_rcv_rgst_int        : 1;
        FIELD llid6_rcv_rgst_int        : 1;
        FIELD llid7_rcv_rgst_int        : 1;
        FIELD gnt_buf_ovrrun_int        : 1;
        FIELD ptp_msg_tx_int            : 1;
        FIELD tod_updt_int              : 1;
        FIELD tod_1pps_int              : 1;
        FIELD timedrft_int              : 1;
        FIELD mpcp_timeout_int          : 1;
        FIELD rpt_overintvl_int         : 1;
        FIELD rsv_16                    : 16;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_e_int_status, *PREG_e_int_status;

typedef union
{
    struct
    {
#ifdef __BIG_ENDIAN
        FIELD rsv_16                    : 16;
        FIELD rpt_overintvl_en          : 1;
        FIELD mpcp_timeout_en           : 1;
        FIELD timedrft_en               : 1;
        FIELD tod_1pps_en               : 1;
        FIELD tod_updt_en               : 1;
        FIELD ptp_msg_tx_en             : 1;
        FIELD gnt_buf_ovrrun_en         : 1;
        FIELD llid7_rcv_rgst_en         : 1;
        FIELD llid6_rcv_rgst_en         : 1;
        FIELD llid5_rcv_rgst_en         : 1;
        FIELD llid4_rcv_rgst_en         : 1;
        FIELD llid3_rcv_rgst_en         : 1;
        FIELD llid2_rcv_rgst_en         : 1;
        FIELD llid1_rcv_rgst_en         : 1;
        FIELD llid0_rcv_rgst_en         : 1;
        FIELD rcv_dscvry_gate_en        : 1;
#else
        FIELD rcv_dscvry_gate_en        : 1;
        FIELD llid0_rcv_rgst_en         : 1;
        FIELD llid1_rcv_rgst_en         : 1;
        FIELD llid2_rcv_rgst_en         : 1;
        FIELD llid3_rcv_rgst_en         : 1;
        FIELD llid4_rcv_rgst_en         : 1;
        FIELD llid5_rcv_rgst_en         : 1;
        FIELD llid6_rcv_rgst_en         : 1;
        FIELD llid7_rcv_rgst_en         : 1;
        FIELD gnt_buf_ovrrun_en         : 1;
        FIELD ptp_msg_tx_en             : 1;
        FIELD tod_updt_en               : 1;
        FIELD tod_1pps_en               : 1;
        FIELD timedrft_en               : 1;
        FIELD mpcp_timeout_en           : 1;
        FIELD rpt_overintvl_en          : 1;
        FIELD rsv_16                    : 16;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_e_int_en, *PREG_e_int_en;

typedef union
{
    struct
    {
#ifdef __BIG_ENDIAN
        FIELD rsv_16                    : 16;
        FIELD llid7_mpcp_tmo            : 1;
        FIELD llid6_mpcp_tmo            : 1;
        FIELD llid5_mpcp_tmo            : 1;
        FIELD llid4_mpcp_tmo            : 1;
        FIELD llid3_mpcp_tmo            : 1;
        FIELD llid2_mpcp_tmo            : 1;
        FIELD llid1_mpcp_tmo            : 1;
        FIELD llid0_mpcp_tmo            : 1;
        FIELD llid7_rpt_tmo             : 1;
        FIELD llid6_rpt_tmo             : 1;
        FIELD llid5_rpt_tmo             : 1;
        FIELD llid4_rpt_tmo             : 1;
        FIELD llid3_rpt_tmo             : 1;
        FIELD llid2_rpt_tmo             : 1;
        FIELD llid1_rpt_tmo             : 1;
        FIELD llid0_rpt_tmo             : 1;
#else
        FIELD llid0_rpt_tmo             : 1;
        FIELD llid1_rpt_tmo             : 1;
        FIELD llid2_rpt_tmo             : 1;
        FIELD llid3_rpt_tmo             : 1;
        FIELD llid4_rpt_tmo             : 1;
        FIELD llid5_rpt_tmo             : 1;
        FIELD llid6_rpt_tmo             : 1;
        FIELD llid7_rpt_tmo             : 1;
        FIELD llid0_mpcp_tmo            : 1;
        FIELD llid1_mpcp_tmo            : 1;
        FIELD llid2_mpcp_tmo            : 1;
        FIELD llid3_mpcp_tmo            : 1;
        FIELD llid4_mpcp_tmo            : 1;
        FIELD llid5_mpcp_tmo            : 1;
        FIELD llid6_mpcp_tmo            : 1;
        FIELD llid7_mpcp_tmo            : 1;
        FIELD rsv_16                    : 16;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_e_rpt_mpcp_timeout_llid_idx, *PREG_e_rpt_mpcp_timeout_llid_idx;

typedef union
{
    struct
    {
#ifdef __BIG_ENDIAN
        FIELD hw_dying_gasp_en          : 1;
        FIELD rsv_17                    : 14;
        FIELD sw_init_dying_gasp        : 1;
        FIELD rsv_10                    : 6;
        FIELD dygsp_num_of_times        : 2;
        FIELD rsv_7                     : 1;
        FIELD dying_gasp_flags          : 7;
#else
        FIELD dying_gasp_flags          : 7;
        FIELD rsv_7                     : 1;
        FIELD dygsp_num_of_times        : 2;
        FIELD rsv_10                    : 6;
        FIELD sw_init_dying_gasp        : 1;
        FIELD rsv_17                    : 14;
        FIELD hw_dying_gasp_en          : 1;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_e_dyinggsp_cfg, *PREG_e_dyinggsp_cfg;

typedef union
{
    struct
    {
#ifdef __BIG_ENDIAN
        FIELD rsv_7                     : 25;
        FIELD pending_gnt_num           : 7;
#else
        FIELD pending_gnt_num           : 7;
        FIELD rsv_7                     : 25;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_e_pending_gnt_num, *PREG_e_pending_gnt_num;

typedef union
{
    struct
    {
#ifdef __BIG_ENDIAN
        FIELD rsv_28                    : 4;
        FIELD llid3_txfec_en            : 1;
        FIELD llid3_dcrypt_en           : 1;
        FIELD llid3_dcrypt_mode         : 1;
        FIELD llid3_oam_lpbk_en         : 1;
        FIELD rsv_20                    : 4;
        FIELD llid2_txfec_en            : 1;
        FIELD llid2_dcrypt_en           : 1;
        FIELD llid2_dcrypt_mode         : 1;
        FIELD llid2_oam_lpbk_en         : 1;
        FIELD rsv_12                    : 4;
        FIELD llid1_txfec_en            : 1;
        FIELD llid1_dcrypt_en           : 1;
        FIELD llid1_dcrypt_mode         : 1;
        FIELD llid1_oam_lpbk_en         : 1;
        FIELD rsv_4                     : 4;
        FIELD llid0_txfec_en            : 1;
        FIELD llid0_dcrypt_en           : 1;
        FIELD llid0_dcrypt_mode         : 1;
        FIELD llid0_oam_lpbk_en         : 1;
#else
        FIELD llid0_oam_lpbk_en         : 1;
        FIELD llid0_dcrypt_mode         : 1;
        FIELD llid0_dcrypt_en           : 1;
        FIELD llid0_txfec_en            : 1;
        FIELD rsv_4                     : 4;
        FIELD llid1_oam_lpbk_en         : 1;
        FIELD llid1_dcrypt_mode         : 1;
        FIELD llid1_dcrypt_en           : 1;
        FIELD llid1_txfec_en            : 1;
        FIELD rsv_12                    : 4;
        FIELD llid2_oam_lpbk_en         : 1;
        FIELD llid2_dcrypt_mode         : 1;
        FIELD llid2_dcrypt_en           : 1;
        FIELD llid2_txfec_en            : 1;
        FIELD rsv_20                    : 4;
        FIELD llid3_oam_lpbk_en         : 1;
        FIELD llid3_dcrypt_mode         : 1;
        FIELD llid3_dcrypt_en           : 1;
        FIELD llid3_txfec_en            : 1;
        FIELD rsv_28                    : 4;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_e_llid0_3_cfg, *PREG_e_llid0_3_cfg;

typedef union
{
    struct
    {
#ifdef __BIG_ENDIAN
        FIELD rsv_28                    : 4;
        FIELD llid7_txfec_en            : 1;
        FIELD llid7_dcrypt_en           : 1;
        FIELD llid7_dcrypt_mode         : 1;
        FIELD llid7_oam_lpbk_en         : 1;
        FIELD rsv_20                    : 4;
        FIELD llid6_txfec_en            : 1;
        FIELD llid6_dcrypt_en           : 1;
        FIELD llid6_dcrypt_mode         : 1;
        FIELD llid6_oam_lpbk_en         : 1;
        FIELD rsv_12                    : 4;
        FIELD llid5_txfec_en            : 1;
        FIELD llid5_dcrypt_en           : 1;
        FIELD llid5_dcrypt_mode         : 1;
        FIELD llid5_oam_lpbk_en         : 1;
        FIELD rsv_4                     : 4;
        FIELD llid4_txfec_en            : 1;
        FIELD llid4_dcrypt_en           : 1;
        FIELD llid4_dcrypt_mode         : 1;
        FIELD llid4_oam_lpbk_en         : 1;
#else
        FIELD llid4_oam_lpbk_en         : 1;
        FIELD llid4_dcrypt_mode         : 1;
        FIELD llid4_dcrypt_en           : 1;
        FIELD llid4_txfec_en            : 1;
        FIELD rsv_4                     : 4;
        FIELD llid5_oam_lpbk_en         : 1;
        FIELD llid5_dcrypt_mode         : 1;
        FIELD llid5_dcrypt_en           : 1;
        FIELD llid5_txfec_en            : 1;
        FIELD rsv_12                    : 4;
        FIELD llid6_oam_lpbk_en         : 1;
        FIELD llid6_dcrypt_mode         : 1;
        FIELD llid6_dcrypt_en           : 1;
        FIELD llid6_txfec_en            : 1;
        FIELD rsv_20                    : 4;
        FIELD llid7_oam_lpbk_en         : 1;
        FIELD llid7_dcrypt_mode         : 1;
        FIELD llid7_dcrypt_en           : 1;
        FIELD llid7_txfec_en            : 1;
        FIELD rsv_28                    : 4;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_e_llid4_7_cfg, *PREG_e_llid4_7_cfg;

typedef union
{
    struct
    {
#ifdef __BIG_ENDIAN
        FIELD mpcp_cmd                  : 2;
        FIELD rsv_17                    : 13;
        FIELD mpcp_cmd_done             : 1;
        FIELD rsv_13                    : 3;
        FIELD rgstr_ack_flg             : 1;
        FIELD rsv_9                     : 3;
        FIELD rgstr_req_flg             : 1;
        FIELD rsv_3                     : 5;
        FIELD tx_mpcp_llid_idx          : 3;
#else
        FIELD tx_mpcp_llid_idx          : 3;
        FIELD rsv_3                     : 5;
        FIELD rgstr_req_flg             : 1;
        FIELD rsv_9                     : 3;
        FIELD rgstr_ack_flg             : 1;
        FIELD rsv_13                    : 3;
        FIELD mpcp_cmd_done             : 1;
        FIELD rsv_17                    : 13;
        FIELD mpcp_cmd                  : 2;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_e_llid_dscvry_ctrl, *PREG_e_llid_dscvry_ctrl;

typedef union
{
    struct
    {
#ifdef __BIG_ENDIAN
        FIELD llid0_dscvry_sts          : 2;
        FIELD rsv_26                    : 4;
        FIELD llid0_rgstr_flg_sts       : 2;
        FIELD rsv_17                    : 7;
        FIELD llid0_valid               : 1;
        FIELD llid0_value               : 16;
#else
        FIELD llid0_value               : 16;
        FIELD llid0_valid               : 1;
        FIELD rsv_17                    : 7;
        FIELD llid0_rgstr_flg_sts       : 2;
        FIELD rsv_26                    : 4;
        FIELD llid0_dscvry_sts          : 2;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_e_llid0_dscvry_sts, *PREG_e_llid0_dscvry_sts;

typedef union
{
    struct
    {
#ifdef __BIG_ENDIAN
        FIELD llid1_dscvry_sts          : 2;
        FIELD rsv_26                    : 4;
        FIELD llid1_rgstr_flg_sts       : 2;
        FIELD rsv_17                    : 7;
        FIELD llid1_valid               : 1;
        FIELD llid1_value               : 16;
#else
        FIELD llid1_value               : 16;
        FIELD llid1_valid               : 1;
        FIELD rsv_17                    : 7;
        FIELD llid1_rgstr_flg_sts       : 2;
        FIELD rsv_26                    : 4;
        FIELD llid1_dscvry_sts          : 2;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_e_llid1_dscvry_sts, *PREG_e_llid1_dscvry_sts;

typedef union
{
    struct
    {
#ifdef __BIG_ENDIAN
        FIELD llid2_dscvry_sts          : 2;
        FIELD rsv_26                    : 4;
        FIELD llid2_rgstr_flg_sts       : 2;
        FIELD rsv_17                    : 7;
        FIELD llid2_valid               : 1;
        FIELD llid2_value               : 16;
#else
        FIELD llid2_value               : 16;
        FIELD llid2_valid               : 1;
        FIELD rsv_17                    : 7;
        FIELD llid2_rgstr_flg_sts       : 2;
        FIELD rsv_26                    : 4;
        FIELD llid2_dscvry_sts          : 2;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_e_llid2_dscvry_sts, *PREG_e_llid2_dscvry_sts;

typedef union
{
    struct
    {
#ifdef __BIG_ENDIAN
        FIELD llid3_dscvry_sts          : 2;
        FIELD rsv_26                    : 4;
        FIELD llid3_rgstr_flg_sts       : 2;
        FIELD rsv_17                    : 7;
        FIELD llid3_valid               : 1;
        FIELD llid3_value               : 16;
#else
        FIELD llid3_value               : 16;
        FIELD llid3_valid               : 1;
        FIELD rsv_17                    : 7;
        FIELD llid3_rgstr_flg_sts       : 2;
        FIELD rsv_26                    : 4;
        FIELD llid3_dscvry_sts          : 2;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_e_llid3_dscvry_sts, *PREG_e_llid3_dscvry_sts;

typedef union
{
    struct
    {
#ifdef __BIG_ENDIAN
        FIELD llid4_dscvry_sts          : 2;
        FIELD rsv_26                    : 4;
        FIELD llid4_rgstr_flg_sts       : 2;
        FIELD rsv_17                    : 7;
        FIELD llid4_valid               : 1;
        FIELD llid4_value               : 16;
#else
        FIELD llid4_value               : 16;
        FIELD llid4_valid               : 1;
        FIELD rsv_17                    : 7;
        FIELD llid4_rgstr_flg_sts       : 2;
        FIELD rsv_26                    : 4;
        FIELD llid4_dscvry_sts          : 2;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_e_llid4_dscvry_sts, *PREG_e_llid4_dscvry_sts;

typedef union
{
    struct
    {
#ifdef __BIG_ENDIAN
        FIELD llid5_dscvry_sts          : 2;
        FIELD rsv_26                    : 4;
        FIELD llid5_rgstr_flg_sts       : 2;
        FIELD rsv_17                    : 7;
        FIELD llid5_valid               : 1;
        FIELD llid5_value               : 16;
#else
        FIELD llid5_value               : 16;
        FIELD llid5_valid               : 1;
        FIELD rsv_17                    : 7;
        FIELD llid5_rgstr_flg_sts       : 2;
        FIELD rsv_26                    : 4;
        FIELD llid5_dscvry_sts          : 2;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_e_llid5_dscvry_sts, *PREG_e_llid5_dscvry_sts;

typedef union
{
    struct
    {
#ifdef __BIG_ENDIAN
        FIELD llid6_dscvry_sts          : 2;
        FIELD rsv_26                    : 4;
        FIELD llid6_rgstr_flg_sts       : 2;
        FIELD rsv_17                    : 7;
        FIELD llid6_valid               : 1;
        FIELD llid6_value               : 16;
#else
        FIELD llid6_value               : 16;
        FIELD llid6_valid               : 1;
        FIELD rsv_17                    : 7;
        FIELD llid6_rgstr_flg_sts       : 2;
        FIELD rsv_26                    : 4;
        FIELD llid6_dscvry_sts          : 2;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_e_llid6_dscvry_sts, *PREG_e_llid6_dscvry_sts;

typedef union
{
    struct
    {
#ifdef __BIG_ENDIAN
        FIELD llid7_dscvry_sts          : 2;
        FIELD rsv_26                    : 4;
        FIELD llid7_rgstr_flg_sts       : 2;
        FIELD rsv_17                    : 7;
        FIELD llid7_valid               : 1;
        FIELD llid7_value               : 16;
#else
        FIELD llid7_value               : 16;
        FIELD llid7_valid               : 1;
        FIELD rsv_17                    : 7;
        FIELD llid7_rgstr_flg_sts       : 2;
        FIELD rsv_26                    : 4;
        FIELD llid7_dscvry_sts          : 2;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_e_llid7_dscvry_sts, *PREG_e_llid7_dscvry_sts;

typedef union
{
    struct
    {
#ifdef __BIG_ENDIAN
        FIELD mac_addr_rwcmd            : 1;
        FIELD rsv_17                    : 14;
        FIELD mac_addr_rwcmd_done       : 1;
        FIELD rsv_4                     : 12;
        FIELD mac_addr_llid_indx        : 3;
        FIELD mac_addr_dw_idx           : 1;
#else
        FIELD mac_addr_dw_idx           : 1;
        FIELD mac_addr_llid_indx        : 3;
        FIELD rsv_4                     : 12;
        FIELD mac_addr_rwcmd_done       : 1;
        FIELD rsv_17                    : 14;
        FIELD mac_addr_rwcmd            : 1;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_e_mac_addr_cfg, *PREG_e_mac_addr_cfg;

typedef union
{
    struct
    {
        FIELD mac_addr_value            : 32;
    } Bits;
    UINT32 Raw;
} REG_e_mac_addr_value, *PREG_e_mac_addr_value;

typedef union
{
    struct
    {
#ifdef __BIG_ENDIAN
        FIELD key_rwcmd                 : 1;
        FIELD rsv_17                    : 14;
        FIELD key_rwcmd_done            : 1;
        FIELD rsv_6                     : 10;
        FIELD key_llid_index            : 3;
        FIELD key_idx                   : 1;
        FIELD key_dw_indx               : 2;
#else
        FIELD key_dw_indx               : 2;
        FIELD key_idx                   : 1;
        FIELD key_llid_index            : 3;
        FIELD rsv_6                     : 10;
        FIELD key_rwcmd_done            : 1;
        FIELD rsv_17                    : 14;
        FIELD key_rwcmd                 : 1;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_e_security_key_cfg, *PREG_e_security_key_cfg;

typedef union
{
    struct
    {
#ifdef __BIG_ENDIAN
        FIELD rsv_24                    : 8;
        FIELD key_value                 : 24;
#else
        FIELD key_value                 : 24;
        FIELD rsv_24                    : 8;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_e_key_value, *PREG_e_key_value;

typedef union
{
    struct
    {
        FIELD df_rpt_data               : 32;
    } Bits;
    UINT32 Raw;
} REG_e_rpt_data, *PREG_e_rpt_data;

typedef union
{
    struct
    {
#ifdef __BIG_ENDIAN
        FIELD rsv_9                     : 23;
        FIELD df_rpt_fifo_clr           : 1;
        FIELD rsv_6                     : 2;
        FIELD df_rpt_dt_len             : 6;
#else
        FIELD df_rpt_dt_len             : 6;
        FIELD rsv_6                     : 2;
        FIELD df_rpt_fifo_clr           : 1;
        FIELD rsv_9                     : 23;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_e_rpt_len, *PREG_e_rpt_len;

typedef union
{
    struct
    {
        FIELD local_time                : 32;
    } Bits;
    UINT32 Raw;
} REG_e_local_time, *PREG_e_local_time;

typedef union
{
    struct
    {
        FIELD tod_sync_x                : 32;
    } Bits;
    UINT32 Raw;
} REG_e_tod_sync_x, *PREG_e_tod_sync_x;

typedef union
{
    struct
    {
#ifdef __BIG_ENDIAN
        FIELD rsv_19                    : 13;
        FIELD ingrs_latency             : 11;
        FIELD egrs_latency              : 8;
#else
        FIELD egrs_latency              : 8;
        FIELD ingrs_latency             : 11;
        FIELD rsv_19                    : 13;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_e_tod_ltncy, *PREG_e_tod_ltncy;

typedef union
{
    struct
    {
#ifdef __BIG_ENDIAN
        FIELD p2p_tx_tagging_done       : 1;
        FIELD rsv_12                    : 19;
        FIELD p2p_tx_pkt_info           : 4;
        FIELD p2p_tx_tag_sec_l8         : 8;
#else
        FIELD p2p_tx_tag_sec_l8         : 8;
        FIELD p2p_tx_pkt_info           : 4;
        FIELD rsv_12                    : 19;
        FIELD p2p_tx_tagging_done       : 1;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_p2p_tx_tag1, *PREG_p2p_tx_tag1;

typedef union
{
    struct
    {
#ifdef __BIG_ENDIAN
        FIELD rsv_25                    : 7;
        FIELD p2p_tx_tag_nsec_29_5      : 25;
#else
        FIELD p2p_tx_tag_nsec_29_5      : 25;
        FIELD rsv_25                    : 7;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_p2p_tx_tag2, *PREG_p2p_tx_tag2;

typedef union
{
    struct
    {
        FIELD new_tod_p2p_offset_sec_l32 : 32;
    } Bits;
    UINT32 Raw;
} REG_e_new_tod_p2p_offset_sec_l32, *PREG_e_new_tod_p2p_offset_sec_l32;

typedef union
{
    struct
    {
        FIELD new_tod_nsec              : 32;
    } Bits;
    UINT32 Raw;
} REG_e_new_tod_p2p_tod_offset_nsec, *PREG_e_new_tod_p2p_tod_offset_nsec;

typedef union
{
    struct
    {
        FIELD tod_p2p_sec_l32           : 32;
    } Bits;
    UINT32 Raw;
} REG_e_tod_p2p_tod_sec_l32, *PREG_e_tod_p2p_tod_sec_l32;

typedef union
{
    struct
    {
        FIELD tod_p2p_nsec              : 32;
    } Bits;
    UINT32 Raw;
} REG_e_tod_p2p_tod_nsec, *PREG_e_tod_p2p_tod_nsec;

typedef union
{
    struct
    {
#ifdef __BIG_ENDIAN
        FIELD rsv_8                     : 24;
        FIELD tod_period                : 8;
#else
        FIELD tod_period                : 8;
        FIELD rsv_8                     : 24;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_e_tod_period, *PREG_e_tod_period;

typedef union
{
    struct
    {
#ifdef __BIG_ENDIAN
        FIELD tx_fetch_overhead         : 8;
        FIELD tx_fetch_leadtime         : 8;
        FIELD rsv_12                    : 4;
        FIELD tx_dma_leadtime           : 12;
#else
        FIELD tx_dma_leadtime           : 12;
        FIELD rsv_12                    : 4;
        FIELD tx_fetch_leadtime         : 8;
        FIELD tx_fetch_overhead         : 8;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_e_txfetch_cfg, *PREG_e_txfetch_cfg;

typedef union
{
    struct
    {
#ifdef __BIG_ENDIAN
        FIELD rsv_17                    : 15;
        FIELD sync_time_updte           : 1;
        FIELD sync_time                 : 16;
#else
        FIELD sync_time                 : 16;
        FIELD sync_time_updte           : 1;
        FIELD rsv_17                    : 15;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_e_sync_time, *PREG_e_sync_time;

typedef union
{
    struct
    {
#ifdef __BIG_ENDIAN
        FIELD dscvr_gnt_len             : 8;
        FIELD fec_tail_grd              : 8;
        FIELD tail_grd                  : 8;
        FIELD rsv_6                     : 2;
        FIELD default_ovrhd             : 6;
#else
        FIELD default_ovrhd             : 6;
        FIELD rsv_6                     : 2;
        FIELD tail_grd                  : 8;
        FIELD fec_tail_grd              : 8;
        FIELD dscvr_gnt_len             : 8;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_e_tx_cal_cnst, *PREG_e_tx_cal_cnst;

typedef union
{
    struct
    {
#ifdef __BIG_ENDIAN
        FIELD rsv_16                    : 16;
        FIELD laser_off_time            : 8;
        FIELD laser_on_time             : 8;
#else
        FIELD laser_on_time             : 8;
        FIELD laser_off_time            : 8;
        FIELD rsv_16                    : 16;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_e_laser_onoff_time, *PREG_e_laser_onoff_time;

typedef union
{
    struct
    {
#ifdef __BIG_ENDIAN
        FIELD rsv_8                     : 24;
        FIELD guard_thrshld             : 8;
#else
        FIELD guard_thrshld             : 8;
        FIELD rsv_8                     : 24;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_e_grd_thrshld, *PREG_e_grd_thrshld;

typedef union
{
    struct
    {
        FIELD mpcp_timeout_intvl        : 32;
    } Bits;
    UINT32 Raw;
} REG_e_mpcp_timeout_intvl, *PREG_e_mpcp_timeout_intvl;

typedef union
{
    struct
    {
#ifdef __BIG_ENDIAN
        FIELD rsv_24                    : 8;
        FIELD rpt_timeout_intvl         : 24;
#else
        FIELD rpt_timeout_intvl         : 24;
        FIELD rsv_24                    : 8;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_e_rpt_timeout_intvl, *PREG_e_rpt_timeout_intvl;

typedef union
{
    struct
    {
        FIELD max_future_gnt_time       : 32;
    } Bits;
    UINT32 Raw;
} REG_e_max_future_gnt_time, *PREG_e_max_future_gnt_time;

typedef union
{
    struct
    {
#ifdef __BIG_ENDIAN
        FIELD rsv_16                    : 16;
        FIELD min_proc_time             : 16;
#else
        FIELD min_proc_time             : 16;
        FIELD rsv_16                    : 16;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_e_min_proc_time, *PREG_e_min_proc_time;

typedef union
{
    struct
    {
#ifdef __BIG_ENDIAN
        FIELD tx_tmstp_adj              : 16;
        FIELD tx_stm_adj                : 16;
#else
        FIELD tx_stm_adj                : 16;
        FIELD tx_tmstp_adj              : 16;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_e_trx_adjust_time1, *PREG_e_trx_adjust_time1;

typedef union
{
    struct
    {
#ifdef __BIG_ENDIAN
        FIELD tx_len_adj                : 16;
        FIELD rx_tmstp_adj              : 16;
#else
        FIELD rx_tmstp_adj              : 16;
        FIELD tx_len_adj                : 16;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_e_trx_adjust_time2, *PREG_e_trx_adjust_time2;

typedef union
{
    struct
    {
#ifdef __BIG_ENDIAN
        FIELD rsv_12                    : 20;
        FIELD probe_bit0_sel            : 4;
        FIELD rsv_5                     : 3;
        FIELD probe_sel                 : 5;
#else
        FIELD probe_sel                 : 5;
        FIELD rsv_5                     : 3;
        FIELD probe_bit0_sel            : 4;
        FIELD rsv_12                    : 20;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_e_dbg_prb_sel, *PREG_e_dbg_prb_sel;

typedef union
{
    struct
    {
        FIELD probe_h32                 : 32;
    } Bits;
    UINT32 Raw;
} REG_e_dbg_prb_h32, *PREG_e_dbg_prb_h32;

typedef union
{
    struct
    {
        FIELD probe_l32                 : 32;
    } Bits;
    UINT32 Raw;
} REG_e_dbg_prb_l32, *PREG_e_dbg_prb_l32;

typedef union
{
    struct
    {
        FIELD rxmbi_eth_cnt             : 32;
    } Bits;
    UINT32 Raw;
} REG_e_rxmbi_eth_cnt, *PREG_e_rxmbi_eth_cnt;

typedef union
{
    struct
    {
        FIELD rxmpi_eth_cnt             : 32;
    } Bits;
    UINT32 Raw;
} REG_e_rxmpi_eth_cnt, *PREG_e_rxmpi_eth_cnt;

typedef union
{
    struct
    {
        FIELD txmbi_eth_cnt             : 32;
    } Bits;
    UINT32 Raw;
} REG_e_txmbi_eth_cnt, *PREG_e_txmbi_eth_cnt;

typedef union
{
    struct
    {
        FIELD txmpi_eth_cnt             : 32;
    } Bits;
    UINT32 Raw;
} REG_e_txmpi_eth_cnt, *PREG_e_txmpi_eth_cnt;

typedef union
{
    struct
    {
#ifdef __BIG_ENDIAN
        FIELD rx_oam_cnt                : 16;
        FIELD tx_oam_cnt                : 16;
#else
        FIELD tx_oam_cnt                : 16;
        FIELD rx_oam_cnt                : 16;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_e_oam_stat, *PREG_e_oam_stat;

typedef union
{
    struct
    {
#ifdef __BIG_ENDIAN
        FIELD mpcp_err_cnt              : 8;
        FIELD mpcp_rgst_cnt             : 8;
        FIELD mpcp_dscv_gate_cnt        : 16;
#else
        FIELD mpcp_dscv_gate_cnt        : 16;
        FIELD mpcp_rgst_cnt             : 8;
        FIELD mpcp_err_cnt              : 8;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_e_mpcp_stat, *PREG_e_mpcp_stat;

typedef union
{
    struct
    {
#ifdef __BIG_ENDIAN
        FIELD rsv_16                    : 16;
        FIELD mpcp_rgst_req_cnt         : 8;
        FIELD mpcp_rgst_ack_cnt         : 8;
#else
        FIELD mpcp_rgst_ack_cnt         : 8;
        FIELD mpcp_rgst_req_cnt         : 8;
        FIELD rsv_16                    : 16;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_e_mpcp_rgst_stat, *PREG_e_mpcp_rgst_stat;

typedef union
{
    struct
    {
#ifdef __BIG_ENDIAN
        FIELD rsv_23                    : 9;
        FIELD max_gnt_pending_cnt       : 7;
        FIELD rsv_7                     : 9;
        FIELD cur_gnt_pending_cnt       : 7;
#else
        FIELD cur_gnt_pending_cnt       : 7;
        FIELD rsv_7                     : 9;
        FIELD max_gnt_pending_cnt       : 7;
        FIELD rsv_23                    : 9;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_e_gnt_pending_stat, *PREG_e_gnt_pending_stat;

typedef union
{
    struct
    {
#ifdef __BIG_ENDIAN
        FIELD max_gnt_length            : 16;
        FIELD min_gnt_length            : 16;
#else
        FIELD min_gnt_length            : 16;
        FIELD max_gnt_length            : 16;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_e_gnt_length_stat, *PREG_e_gnt_length_stat;

typedef union
{
    struct
    {
#ifdef __BIG_ENDIAN
        FIELD b2b_gnt_cnt               : 16;
        FIELD hdn_gnt_cnt               : 16;
#else
        FIELD hdn_gnt_cnt               : 16;
        FIELD b2b_gnt_cnt               : 16;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_e_gnt_type_stat, *PREG_e_gnt_type_stat;

typedef union
{
    struct
    {
#ifdef __BIG_ENDIAN
        FIELD rsv_16                    : 16;
        FIELD cur_time_drift            : 8;
        FIELD max_time_drift            : 8;
#else
        FIELD max_time_drift            : 8;
        FIELD cur_time_drift            : 8;
        FIELD rsv_16                    : 16;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_e_time_drft_stat, *PREG_e_time_drft_stat;

typedef union
{
    struct
    {
        FIELD llid0_gnt_cnt             : 32;
    } Bits;
    UINT32 Raw;
} REG_e_llid0_gnt_stat, *PREG_e_llid0_gnt_stat;

typedef union
{
    struct
    {
        FIELD llid1_gnt_cnt             : 32;
    } Bits;
    UINT32 Raw;
} REG_e_llid1_gnt_stat, *PREG_e_llid1_gnt_stat;

typedef union
{
    struct
    {
        FIELD llid2_gnt_cnt             : 32;
    } Bits;
    UINT32 Raw;
} REG_e_llid2_gnt_stat, *PREG_e_llid2_gnt_stat;

typedef union
{
    struct
    {
        FIELD llid3_gnt_cnt             : 32;
    } Bits;
    UINT32 Raw;
} REG_e_llid3_gnt_stat, *PREG_e_llid3_gnt_stat;

typedef union
{
    struct
    {
        FIELD llid4_gnt_cnt             : 32;
    } Bits;
    UINT32 Raw;
} REG_e_llid4_gnt_stat, *PREG_e_llid4_gnt_stat;

typedef union
{
    struct
    {
        FIELD llid5_gnt_cnt             : 32;
    } Bits;
    UINT32 Raw;
} REG_e_llid5_gnt_stat, *PREG_e_llid5_gnt_stat;

typedef union
{
    struct
    {
        FIELD llid6_gnt_cnt             : 32;
    } Bits;
    UINT32 Raw;
} REG_e_llid6_gnt_stat, *PREG_e_llid6_gnt_stat;

typedef union
{
    struct
    {
        FIELD llid7_gnt_cnt             : 32;
    } Bits;
    UINT32 Raw;
} REG_e_llid7_gnt_stat, *PREG_e_llid7_gnt_stat;

// ----------------- EPON_MAC  Grouping Definitions -------------------
// ----------------- EPON_MAC Register Definition -------------------
typedef volatile struct
{
    UINT32                          rsv_0000[6144];   // 0000..5FFC
    REG_e_glb_cfg                   e_glb_cfg;        // 6000
    REG_e_int_status                e_int_status;     // 6004
    REG_e_int_en                    e_int_en;         // 6008
    REG_e_rpt_mpcp_timeout_llid_idx e_rpt_mpcp_timeout_llid_idx; // 600C
    REG_e_dyinggsp_cfg              e_dyinggsp_cfg;   // 6010
    REG_e_pending_gnt_num           e_pending_gnt_num; // 6014
    UINT32                          rsv_6018[2];      // 6018..601C
    REG_e_llid0_3_cfg               e_llid0_3_cfg;    // 6020
    REG_e_llid4_7_cfg               e_llid4_7_cfg;    // 6024
    REG_e_llid_dscvry_ctrl          e_llid_dscvry_ctrl; // 6028
    REG_e_llid0_dscvry_sts          e_llid0_dscvry_sts; // 602C
    REG_e_llid1_dscvry_sts          e_llid1_dscvry_sts; // 6030
    REG_e_llid2_dscvry_sts          e_llid2_dscvry_sts; // 6034
    REG_e_llid3_dscvry_sts          e_llid3_dscvry_sts; // 6038
    REG_e_llid4_dscvry_sts          e_llid4_dscvry_sts; // 603C
    REG_e_llid5_dscvry_sts          e_llid5_dscvry_sts; // 6040
    REG_e_llid6_dscvry_sts          e_llid6_dscvry_sts; // 6044
    REG_e_llid7_dscvry_sts          e_llid7_dscvry_sts; // 6048
    UINT32                          rsv_604C;         // 604C
    REG_e_mac_addr_cfg              e_mac_addr_cfg;   // 6050
    REG_e_mac_addr_value            e_mac_addr_value; // 6054
    REG_e_security_key_cfg          e_security_key_cfg; // 6058
    REG_e_key_value                 e_key_value;      // 605C
    REG_e_rpt_data                  e_rpt_data;       // 6060
    REG_e_rpt_len                   e_rpt_len;        // 6064
    UINT32                          rsv_6068[6];      // 6068..607C
    REG_e_local_time                e_local_time;     // 6080
    REG_e_tod_sync_x                e_tod_sync_x;     // 6084
    REG_e_tod_ltncy                 e_tod_ltncy;      // 6088
    REG_p2p_tx_tag1                 p2p_tx_tag1;      // 608C
    REG_p2p_tx_tag2                 p2p_tx_tag2;      // 6090
    REG_e_new_tod_p2p_offset_sec_l32 e_new_tod_p2p_offset_sec_l32; // 6094
    REG_e_new_tod_p2p_tod_offset_nsec e_new_tod_p2p_tod_offset_nsec; // 6098
    REG_e_tod_p2p_tod_sec_l32       e_tod_p2p_tod_sec_l32; // 609C
    REG_e_tod_p2p_tod_nsec          e_tod_p2p_tod_nsec; // 60A0
    REG_e_tod_period                e_tod_period;     // 60A4
    UINT32                          rsv_60A8[10];     // 60A8..60CC
    REG_e_txfetch_cfg               e_txfetch_cfg;    // 60D0
    REG_e_sync_time                 e_sync_time;      // 60D4
    REG_e_tx_cal_cnst               e_tx_cal_cnst;    // 60D8
    REG_e_laser_onoff_time          e_laser_onoff_time; // 60DC
    REG_e_grd_thrshld               e_grd_thrshld;    // 60E0
    REG_e_mpcp_timeout_intvl        e_mpcp_timeout_intvl; // 60E4
    REG_e_rpt_timeout_intvl         e_rpt_timeout_intvl; // 60E8
    REG_e_max_future_gnt_time       e_max_future_gnt_time; // 60EC
    REG_e_min_proc_time             e_min_proc_time;  // 60F0
    REG_e_trx_adjust_time1          e_trx_adjust_time1; // 60F4
    REG_e_trx_adjust_time2          e_trx_adjust_time2; // 60F8
    UINT32                          rsv_60FC;         // 60FC
    REG_e_dbg_prb_sel               e_dbg_prb_sel;    // 6100
    REG_e_dbg_prb_h32               e_dbg_prb_h32;    // 6104
    REG_e_dbg_prb_l32               e_dbg_prb_l32;    // 6108
    REG_e_rxmbi_eth_cnt             e_rxmbi_eth_cnt;  // 610C
    REG_e_rxmpi_eth_cnt             e_rxmpi_eth_cnt;  // 6110
    REG_e_txmbi_eth_cnt             e_txmbi_eth_cnt;  // 6114
    REG_e_txmpi_eth_cnt             e_txmpi_eth_cnt;  // 6118
    REG_e_oam_stat                  e_oam_stat;       // 611C
    REG_e_mpcp_stat                 e_mpcp_stat;      // 6120
    REG_e_mpcp_rgst_stat            e_mpcp_rgst_stat; // 6124
    REG_e_gnt_pending_stat          e_gnt_pending_stat; // 6128
    REG_e_gnt_length_stat           e_gnt_length_stat; // 612C
    REG_e_gnt_type_stat             e_gnt_type_stat;  // 6130
    REG_e_time_drft_stat            e_time_drft_stat; // 6134
    REG_e_llid0_gnt_stat            e_llid0_gnt_stat; // 6138
    REG_e_llid1_gnt_stat            e_llid1_gnt_stat; // 613C
    REG_e_llid2_gnt_stat            e_llid2_gnt_stat; // 6140
    REG_e_llid3_gnt_stat            e_llid3_gnt_stat; // 6144
    REG_e_llid4_gnt_stat            e_llid4_gnt_stat; // 6148
    REG_e_llid5_gnt_stat            e_llid5_gnt_stat; // 614C
    REG_e_llid6_gnt_stat            e_llid6_gnt_stat; // 6150
    REG_e_llid7_gnt_stat            e_llid7_gnt_stat; // 6154
    UINT32                          rsv_6158[8105];   // 6158..DFF8
    UINT8                           rsv_DFFC;         // DFFC
    UINT16                          rsv_DFFD;         // DFFD
    UINT8                           rsv_E0FF;         // E0FF
    UINT32                          rsv_E100[959];    // E100..EFF8
    UINT8                           rsv_EFFC;         // EFFC
    UINT16                          rsv_EFFD;         // EFFD
}EPON_MAC_REGS, *PEPON_MAC_REGS;	

// ---------- EPON_MAC Enum Definitions      ----------
// ---------- EPON_MAC C Macro Definitions   ----------
extern PEPON_MAC_REGS g_EPON_MAC_BASE;

#define EPON_MAC_BASE                                          (g_EPON_MAC_BASE)

#define e_glb_cfg                                              INREG32(&EPON_MAC_BASE->e_glb_cfg) // 6000
#define e_int_status                                           INREG32(&EPON_MAC_BASE->e_int_status) // 6004
#define e_int_en                                               INREG32(&EPON_MAC_BASE->e_int_en) // 6008
#define e_rpt_mpcp_timeout_llid_idx                            INREG32(&EPON_MAC_BASE->e_rpt_mpcp_timeout_llid_idx) // 600C
#define e_dyinggsp_cfg                                         INREG32(&EPON_MAC_BASE->e_dyinggsp_cfg) // 6010
