#ifndef __gpon_mac_reg_REGS_H__
#define __gpon_mac_reg_REGS_H__
#include <linux/mtd/rt_flash.h>
#include <common/drv_types.h>

#ifdef UINT32
#undef UINT32
#endif
#ifdef __cplusplus
extern "C" {
#endif

#ifndef REG_BASE_C_MODULE
// ----------------- gpon_mac_reg Bit Field Definitions -------------------

#define PLOAMU_CTRL			O3_O4_PLOAMU_CTRL
#define REG_PLOAMU_CTRL		REG_O3_O4_PLOAMU_CTRL
#define PREG_PLOAMU_CTRL	PREG_O3_O4_PLOAMU_CTRL

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD rsv_16                    : 16;
        FIELD onu_id_vld                : 1;
        FIELD rsv_8                     : 7;
        FIELD onu_id                    : 8;
#else
        FIELD onu_id                    : 8;
        FIELD rsv_8                     : 7;
        FIELD onu_id_vld                : 1;
        FIELD rsv_16                    : 16;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_G_ONU_ID, *PREG_G_ONU_ID;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD rsv_17                    : 15;
        FIELD us_fec_en                 : 1;
        FIELD rsv_8                     : 8;
        FIELD sr_blk_size               : 8;
#else
        FIELD sr_blk_size               : 8;
        FIELD rsv_8                     : 8;
        FIELD us_fec_en                 : 1;
        FIELD rsv_17                    : 15;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_G_GBL_CFG, *PREG_G_GBL_CFG;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD bwm_us_fec_err_int        : 1;
        FIELD bwm_stop_time_err_int     : 1;
        FIELD lwi_int                   : 1;
        FIELD fwi_int                   : 1;
        FIELD pop_up_recv_in_O6_int     : 1;
        FIELD onu_us_fec_chg_int        : 1;
        FIELD olt_ds_fec_chg_int        : 1;
        FIELD o5_eqd_adj_done_int       : 1;
        FIELD sfifo_full_int            : 1;
        FIELD bfifo_full_int            : 1;
        FIELD rx_gem_intlv_err_int      : 1;
        FIELD rx_eof_err_int            : 1;
        FIELD tx_late_start_int         : 1;
        FIELD bst_sgl_diff_int          : 1;
        FIELD fifo_err_int              : 1;
        FIELD rx_err_int                : 1;
        FIELD rsv_12                    : 4;
        FIELD dying_gasp_send_int       : 1;
        FIELD tod_1pps_int              : 1;
        FIELD tod_update_done_int       : 1;
        FIELD aes_key_switch_done_int   : 1;
        FIELD los_gem_del_int           : 1;
        FIELD sn_req_crs_int            : 1;
        FIELD sn_onu_send_o4_int        : 1;
        FIELD ranging_req_recv_int      : 1;
        FIELD sn_onu_send_o3_int        : 1;
        FIELD sn_req_recv_int           : 1;
        FIELD ploamu_send_int           : 1;
        FIELD ploamd_recv_int           : 1;
#else
        FIELD ploamd_recv_int           : 1;
        FIELD ploamu_send_int           : 1;
        FIELD sn_req_recv_int           : 1;
        FIELD sn_onu_send_o3_int        : 1;
        FIELD ranging_req_recv_int      : 1;
        FIELD sn_onu_send_o4_int        : 1;
        FIELD sn_req_crs_int            : 1;
        FIELD los_gem_del_int           : 1;
        FIELD aes_key_switch_done_int   : 1;
        FIELD tod_update_done_int       : 1;
        FIELD tod_1pps_int              : 1;
        FIELD dying_gasp_send_int       : 1;
        FIELD rsv_12                    : 4;
        FIELD rx_err_int                : 1;
        FIELD fifo_err_int              : 1;
        FIELD bst_sgl_diff_int          : 1;
        FIELD tx_late_start_int         : 1;
        FIELD rx_eof_err_int            : 1;
        FIELD rx_gem_intlv_err_int      : 1;
        FIELD bfifo_full_int            : 1;
        FIELD sfifo_full_int            : 1;
        FIELD o5_eqd_adj_done_int       : 1;
        FIELD olt_ds_fec_chg_int        : 1;
        FIELD onu_us_fec_chg_int        : 1;
        FIELD pop_up_recv_in_O6_int     : 1;
        FIELD fwi_int                   : 1;
        FIELD lwi_int                   : 1;
        FIELD bwm_stop_time_err_int     : 1;
        FIELD bwm_us_fec_err_int        : 1;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_G_INT_STATUS, *PREG_G_INT_STATUS;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD bwm_us_fec_err_int_en     : 1;
        FIELD bwm_stop_time_err_int_en  : 1;
        FIELD lwi_int_en                : 1;
        FIELD fwi_int_en                : 1;
        FIELD pop_up_recv_in_O6_int_en  : 1;
        FIELD onu_us_fec_chg_int_en     : 1;
        FIELD olt_ds_fec_chg_int_en     : 1;
        FIELD o5_eqd_adj_done_int_en    : 1;
        FIELD sfifo_full_int_en         : 1;
        FIELD bfifo_full_int_en         : 1;
        FIELD rx_gem_intlv_err_int_en   : 1;
        FIELD rx_eof_err_int_en         : 1;
        FIELD tx_late_start_int_en      : 1;
        FIELD bst_sgl_diff_int_en       : 1;
        FIELD fifo_err_int_en           : 1;
        FIELD rx_err_int_en             : 1;
        FIELD rsv_12                    : 4;
        FIELD dying_gasp_send_int_en    : 1;
        FIELD tod_1pps_int_en           : 1;
        FIELD tod_update_done_int_en    : 1;
        FIELD aes_key_switch_done_int_en : 1;
        FIELD los_gem_del_int_en        : 1;
        FIELD sn_req_crs_int_en         : 1;
        FIELD sn_onu_send_o4_int_en     : 1;
        FIELD ranging_req_recv_int_en   : 1;
        FIELD sn_onu_send_o3_int_en     : 1;
        FIELD sn_req_recv_int_en        : 1;
        FIELD ploamu_send_int_en        : 1;
        FIELD ploamd_recv_int_en        : 1;
#else
        FIELD ploamd_recv_int_en        : 1;
        FIELD ploamu_send_int_en        : 1;
        FIELD sn_req_recv_int_en        : 1;
        FIELD sn_onu_send_o3_int_en     : 1;
        FIELD ranging_req_recv_int_en   : 1;
        FIELD sn_onu_send_o4_int_en     : 1;
        FIELD sn_req_crs_int_en         : 1;
        FIELD los_gem_del_int_en        : 1;
        FIELD aes_key_switch_done_int_en : 1;
        FIELD tod_update_done_int_en    : 1;
        FIELD tod_1pps_int_en           : 1;
        FIELD dying_gasp_send_int_en    : 1;
        FIELD rsv_12                    : 4;
        FIELD rx_err_int_en             : 1;
        FIELD fifo_err_int_en           : 1;
        FIELD bst_sgl_diff_int_en       : 1;
        FIELD tx_late_start_int_en      : 1;
        FIELD rx_eof_err_int_en         : 1;
        FIELD rx_gem_intlv_err_int_en   : 1;
        FIELD bfifo_full_int_en         : 1;
        FIELD sfifo_full_int_en         : 1;
        FIELD o5_eqd_adj_done_int_en    : 1;
        FIELD olt_ds_fec_chg_int_en     : 1;
        FIELD onu_us_fec_chg_int_en     : 1;
        FIELD pop_up_recv_in_O6_int_en  : 1;
        FIELD fwi_int_en                : 1;
        FIELD lwi_int_en                : 1;
        FIELD bwm_stop_time_err_int_en  : 1;
        FIELD bwm_us_fec_err_int_en     : 1;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_G_INT_ENABLE, *PREG_G_INT_ENABLE;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD t_cont1_vld               : 1;
        FIELD rsv_28                    : 3;
        FIELD t_cont1_id                : 12;
        FIELD t_cont0_vld               : 1;
        FIELD rsv_12                    : 3;
        FIELD t_cont0_id                : 12;
#else
        FIELD t_cont0_id                : 12;
        FIELD rsv_12                    : 3;
        FIELD t_cont0_vld               : 1;
        FIELD t_cont1_id                : 12;
        FIELD rsv_28                    : 3;
        FIELD t_cont1_vld               : 1;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_G_TCONT_ID_0_1, *PREG_G_TCONT_ID_0_1;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD t_cont3_vld               : 1;
        FIELD rsv_28                    : 3;
        FIELD t_cont3_id                : 12;
        FIELD t_cont2_vld               : 1;
        FIELD rsv_12                    : 3;
        FIELD t_cont2_id                : 12;
#else
        FIELD t_cont2_id                : 12;
        FIELD rsv_12                    : 3;
        FIELD t_cont2_vld               : 1;
        FIELD t_cont3_id                : 12;
        FIELD rsv_28                    : 3;
        FIELD t_cont3_vld               : 1;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_G_TCONT_ID_2_3, *PREG_G_TCONT_ID_2_3;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD t_cont5_vld               : 1;
        FIELD rsv_28                    : 3;
        FIELD t_cont5_id                : 12;
        FIELD t_cont4_vld               : 1;
        FIELD rsv_12                    : 3;
        FIELD t_cont4_id                : 12;
#else
        FIELD t_cont4_id                : 12;
        FIELD rsv_12                    : 3;
        FIELD t_cont4_vld               : 1;
        FIELD t_cont5_id                : 12;
        FIELD rsv_28                    : 3;
        FIELD t_cont5_vld               : 1;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_G_TCONT_ID_4_5, *PREG_G_TCONT_ID_4_5;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD t_cont7_vld               : 1;
        FIELD rsv_28                    : 3;
        FIELD t_cont7_id                : 12;
        FIELD t_cont6_vld               : 1;
        FIELD rsv_12                    : 3;
        FIELD t_cont6_id                : 12;
#else
        FIELD t_cont6_id                : 12;
        FIELD rsv_12                    : 3;
        FIELD t_cont6_vld               : 1;
        FIELD t_cont7_id                : 12;
        FIELD rsv_28                    : 3;
        FIELD t_cont7_vld               : 1;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_G_TCONT_ID_6_7, *PREG_G_TCONT_ID_6_7;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD t_cont9_vld               : 1;
        FIELD rsv_28                    : 3;
        FIELD t_cont9_id                : 12;
        FIELD t_cont8_vld               : 1;
        FIELD rsv_12                    : 3;
        FIELD t_cont8_id                : 12;
#else
        FIELD t_cont8_id                : 12;
        FIELD rsv_12                    : 3;
        FIELD t_cont8_vld               : 1;
        FIELD t_cont9_id                : 12;
        FIELD rsv_28                    : 3;
        FIELD t_cont9_vld               : 1;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_G_TCONT_ID_8_9, *PREG_G_TCONT_ID_8_9;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD t_cont11_vld              : 1;
        FIELD rsv_28                    : 3;
        FIELD t_cont11_id               : 12;
        FIELD t_cont10_vld              : 1;
        FIELD rsv_12                    : 3;
        FIELD t_cont10_id               : 12;
#else
        FIELD t_cont10_id               : 12;
        FIELD rsv_12                    : 3;
        FIELD t_cont10_vld              : 1;
        FIELD t_cont11_id               : 12;
        FIELD rsv_28                    : 3;
        FIELD t_cont11_vld              : 1;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_G_TCONT_ID_10_11, *PREG_G_TCONT_ID_10_11;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD t_cont13_vld              : 1;
        FIELD rsv_28                    : 3;
        FIELD t_cont13_id               : 12;
        FIELD t_cont12_vld              : 1;
        FIELD rsv_12                    : 3;
        FIELD t_cont12_id               : 12;
#else
        FIELD t_cont12_id               : 12;
        FIELD rsv_12                    : 3;
        FIELD t_cont12_vld              : 1;
        FIELD t_cont13_id               : 12;
        FIELD rsv_28                    : 3;
        FIELD t_cont13_vld              : 1;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_G_TCONT_ID_12_13, *PREG_G_TCONT_ID_12_13;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD t_cont15_vld              : 1;
        FIELD rsv_28                    : 3;
        FIELD t_cont15_id               : 12;
        FIELD t_cont14_vld              : 1;
        FIELD rsv_12                    : 3;
        FIELD t_cont14_id               : 12;
#else
        FIELD t_cont14_id               : 12;
        FIELD rsv_12                    : 3;
        FIELD t_cont14_vld              : 1;
        FIELD t_cont15_id               : 12;
        FIELD rsv_28                    : 3;
        FIELD t_cont15_vld              : 1;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_G_TCONT_ID_14_15, *PREG_G_TCONT_ID_14_15;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD gpid_cmd                  : 1;
        FIELD rsv_18                    : 13;
        FIELD gpid_encrypt              : 1;
        FIELD gpid_vld                  : 1;
        FIELD rsv_12                    : 4;
        FIELD gem_port_id               : 12;
#else
        FIELD gem_port_id               : 12;
        FIELD rsv_12                    : 4;
        FIELD gpid_vld                  : 1;
        FIELD gpid_encrypt              : 1;
        FIELD rsv_18                    : 13;
        FIELD gpid_cmd                  : 1;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_G_GEM_PORT_CFG, *PREG_G_GEM_PORT_CFG;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD gpid_cmd_done             : 1;
        FIELD rsv_2                     : 29;
        FIELD gpid_encrypt_sts          : 1;
        FIELD gpid_vld_sts              : 1;
#else
        FIELD gpid_vld_sts              : 1;
        FIELD gpid_encrypt_sts          : 1;
        FIELD rsv_2                     : 29;
        FIELD gpid_cmd_done             : 1;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_G_GEM_PORT_STS, *PREG_G_GEM_PORT_STS;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD rsv_17                    : 15;
        FIELD omci_port_id_vld          : 1;
        FIELD rsv_12                    : 4;
        FIELD omci_gpid                 : 12;
#else
        FIELD omci_gpid                 : 12;
        FIELD rsv_12                    : 4;
        FIELD omci_port_id_vld          : 1;
        FIELD rsv_17                    : 15;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_G_OMCI_ID, *PREG_G_OMCI_ID;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD rsv_9                     : 23;
        FIELD gem_tbl_init_done         : 1;
        FIELD rsv_1                     : 7;
        FIELD gem_tbl_init_start        : 1;
#else
        FIELD gem_tbl_init_start        : 1;
        FIELD rsv_1                     : 7;
        FIELD gem_tbl_init_done         : 1;
        FIELD rsv_9                     : 23;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_G_GEM_TBL_INIT, *PREG_G_GEM_TBL_INIT;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD ploamu_fifo_udrn          : 1;
        FIELD rsv_24                    : 7;
        FIELD ploamu_fifo_min_avail     : 8;
        FIELD rsv_8                     : 8;
        FIELD ploamu_fifo_avail         : 8;
#else
        FIELD ploamu_fifo_avail         : 8;
        FIELD rsv_8                     : 8;
        FIELD ploamu_fifo_min_avail     : 8;
        FIELD rsv_24                    : 7;
        FIELD ploamu_fifo_udrn          : 1;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_G_PLOAMu_FIFO_STS, *PREG_G_PLOAMu_FIFO_STS;

typedef PACKING union
{
    PACKING struct
    {
        FIELD ploamu_wdata              : 32;
    } Bits;
    UINT32 Raw;
} REG_G_PLOAMu_WDATA, *PREG_G_PLOAMu_WDATA;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD ploamd_fifo_ovrn          : 1;
        FIELD rsv_24                    : 7;
        FIELD ploamd_fifo_max_used      : 8;
        FIELD rsv_8                     : 8;
        FIELD ploamd_fifo_used          : 8;
#else
        FIELD ploamd_fifo_used          : 8;
        FIELD rsv_8                     : 8;
        FIELD ploamd_fifo_max_used      : 8;
        FIELD rsv_24                    : 7;
        FIELD ploamd_fifo_ovrn          : 1;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_G_PLOAMd_FIFO_STS, *PREG_G_PLOAMd_FIFO_STS;

typedef PACKING union
{
    PACKING struct
    {
        FIELD ploamd_rdata              : 32;
    } Bits;
    UINT32 Raw;
} REG_G_PLOAMd_RDATA, *PREG_G_PLOAMd_RDATA;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD rsv_30                    : 2;
        FIELD aes_spf_cnt               : 30;
#else
        FIELD aes_spf_cnt               : 30;
        FIELD rsv_30                    : 2;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_G_AES_CFG, *PREG_G_AES_CFG;

typedef PACKING union
{
    PACKING struct
    {
        FIELD aes_active_key0           : 32;
    } Bits;
    UINT32 Raw;
} REG_G_AES_ACTIVE_KEY0, *PREG_G_AES_ACTIVE_KEY0;

typedef PACKING union
{
    PACKING struct
    {
        FIELD aes_active_key1           : 32;
    } Bits;
    UINT32 Raw;
} REG_G_AES_ACTIVE_KEY1, *PREG_G_AES_ACTIVE_KEY1;

typedef PACKING union
{
    PACKING struct
    {
        FIELD aes_active_key2           : 32;
    } Bits;
    UINT32 Raw;
} REG_G_AES_ACTIVE_KEY2, *PREG_G_AES_ACTIVE_KEY2;

typedef PACKING union
{
    PACKING struct
    {
        FIELD aes_active_key3           : 32;
    } Bits;
    UINT32 Raw;
} REG_G_AES_ACTIVE_KEY3, *PREG_G_AES_ACTIVE_KEY3;

typedef PACKING union
{
    PACKING struct
    {
        FIELD aes_shadow_key0           : 32;
    } Bits;
    UINT32 Raw;
} REG_G_AES_SHADOW_KEY0, *PREG_G_AES_SHADOW_KEY0;

typedef PACKING union
{
    PACKING struct
    {
        FIELD aes_shadow_key1           : 32;
    } Bits;
    UINT32 Raw;
} REG_G_AES_SHADOW_KEY1, *PREG_G_AES_SHADOW_KEY1;

typedef PACKING union
{
    PACKING struct
    {
        FIELD aes_shadow_key2           : 32;
    } Bits;
    UINT32 Raw;
} REG_G_AES_SHADOW_KEY2, *PREG_G_AES_SHADOW_KEY2;

typedef PACKING union
{
    PACKING struct
    {
        FIELD aes_shadow_key3           : 32;
    } Bits;
    UINT32 Raw;
} REG_G_AES_SHADOW_KEY3, *PREG_G_AES_SHADOW_KEY3;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD aes_key_switch_by_sw_done : 1;
        FIELD rsv_1                     : 30;
        FIELD aes_key_switch_by_sw_cmd  : 1;
#else
        FIELD aes_key_switch_by_sw_cmd  : 1;
        FIELD rsv_1                     : 30;
        FIELD aes_key_switch_by_sw_done : 1;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_G_AES_KEY_SWITCH_BY_SW, *PREG_G_AES_KEY_SWITCH_BY_SW;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD rsv_8                     : 24;
        FIELD plou_overhead             : 8;
#else
        FIELD plou_overhead             : 8;
        FIELD rsv_8                     : 24;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_G_PLOu_OVERHEAD, *PREG_G_PLOu_OVERHEAD;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD rsv_8                     : 24;
        FIELD guard_bit                 : 8;
#else
        FIELD guard_bit                 : 8;
        FIELD rsv_8                     : 24;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_G_PLOu_GUARD_BIT, *PREG_G_PLOu_GUARD_BIT;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD rsv_16                    : 16;
        FIELD prmb2_bit                 : 8;
        FIELD prmb1_bit                 : 8;
#else
        FIELD prmb1_bit                 : 8;
        FIELD prmb2_bit                 : 8;
        FIELD rsv_16                    : 16;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_G_PLOu_PRMBL_TYPE1_2, *PREG_G_PLOu_PRMBL_TYPE1_2;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD rsv_25                    : 7;
        FIELD ebl_en                    : 1;
        FIELD rsv_16                    : 8;
        FIELD ext_prmb3_o5_num          : 8;
        FIELD ext_prmb3_o3_o4_num       : 8;
#else
        FIELD ext_prmb3_o3_o4_num       : 8;
        FIELD ext_prmb3_o5_num          : 8;
        FIELD rsv_16                    : 8;
        FIELD ebl_en                    : 1;
        FIELD rsv_25                    : 7;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_G_PLOu_PRMBL_TYPE3, *PREG_G_PLOu_PRMBL_TYPE3;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD rsv_8                     : 24;
        FIELD delm_bit                  : 8;
#else
        FIELD delm_bit                  : 8;
        FIELD rsv_8                     : 24;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_G_PLOu_DELM_BIT, *PREG_G_PLOu_DELM_BIT;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD pre_dly_en                : 1;
        FIELD rsv_16                    : 15;
        FIELD pre_dly                   : 16;
#else
        FIELD pre_dly                   : 16;
        FIELD rsv_16                    : 15;
        FIELD pre_dly_en                : 1;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_G_PRE_ASSIGNED_DLY, *PREG_G_PRE_ASSIGNED_DLY;

typedef PACKING union
{
    PACKING struct
    {
        FIELD eqd                       : 32;
    } Bits;
    UINT32 Raw;
} REG_G_EQD, *PREG_G_EQD;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD rsv_16                    : 16;
        FIELD tresp                     : 16;
#else
        FIELD tresp                     : 16;
        FIELD rsv_16                    : 16;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_G_RSP_TIME, *PREG_G_RSP_TIME;

typedef PACKING union
{
    PACKING struct
    {
        FIELD vendor_id                 : 32;
    } Bits;
    UINT32 Raw;
} REG_G_VENDOR_ID, *PREG_G_VENDOR_ID;

typedef PACKING union
{
    PACKING struct
    {
        FIELD vs_sn                     : 32;
    } Bits;
    UINT32 Raw;
} REG_G_VS_SN, *PREG_G_VS_SN;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD sn_req_thr                : 8;
        FIELD rsv_18                    : 6;
        FIELD tx_power_mode             : 2;
        FIELD rsv_12                    : 4;
        FIELD rdm_dly                   : 12;
#else
        FIELD rdm_dly                   : 12;
        FIELD rsv_12                    : 4;
        FIELD tx_power_mode             : 2;
        FIELD rsv_18                    : 6;
        FIELD sn_req_thr                : 8;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_G_SN_MSG_CFG, *PREG_G_SN_MSG_CFG;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD rsv_3                     : 29;
        FIELD act_st                    : 3;
#else
        FIELD act_st                    : 3;
        FIELD rsv_3                     : 29;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_G_ACTIVATION_ST, *PREG_G_ACTIVATION_ST;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD rsv_30                    : 2;
        FIELD tod_spf_cnt               : 30;
#else
        FIELD tod_spf_cnt               : 30;
        FIELD rsv_30                    : 2;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_G_TOD_CFG, *PREG_G_TOD_CFG;

typedef PACKING union
{
    PACKING struct
    {
        FIELD new_tod_sec_l32           : 32;
    } Bits;
    UINT32 Raw;
} REG_G_NEW_TOD_SEC_L32, *PREG_G_NEW_TOD_SEC_L32;

typedef PACKING union
{
    PACKING struct
    {
        FIELD new_tod_nano_sec          : 32;
    } Bits;
    UINT32 Raw;
} REG_G_NEW_TOD_NANO_SEC, *PREG_G_NEW_TOD_NANO_SEC;

typedef PACKING union
{
    PACKING struct
    {
        FIELD cur_tod_sec_l32           : 32;
    } Bits;
    UINT32 Raw;
} REG_G_CUR_TOD_SEC_L32, *PREG_G_CUR_TOD_SEC_L32;

typedef PACKING union
{
    PACKING struct
    {
        FIELD cur_tod_nano_sec          : 32;
    } Bits;
    UINT32 Raw;
} REG_G_CUR_TOD_NANO_SEC, *PREG_G_CUR_TOD_NANO_SEC;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD rsv_8                     : 24;
        FIELD tod_period                : 8;
#else
        FIELD tod_period                : 8;
        FIELD rsv_8                     : 24;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_G_TOD_CLK_PERIOD, *PREG_G_TOD_CLK_PERIOD;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD rsv_9                     : 23;
        FIELD tx_fcs_tbl_init_done      : 1;
        FIELD rsv_1                     : 7;
        FIELD tx_fcs_tbl_init_start     : 1;
#else
        FIELD tx_fcs_tbl_init_start     : 1;
        FIELD rsv_1                     : 7;
        FIELD tx_fcs_tbl_init_done      : 1;
        FIELD rsv_9                     : 23;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_G_TX_FCS_TBL_INIT, *PREG_G_TX_FCS_TBL_INIT;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD mib_cmd                   : 1;
        FIELD mib_cmd_done              : 1;
        FIELD rsv_25                    : 5;
        FIELD mib_read_clr_en           : 1;
        FIELD rsv_19                    : 5;
        FIELD mib_type                  : 3;
        FIELD rsv_12                    : 4;
        FIELD mib_gpid                  : 12;
#else
        FIELD mib_gpid                  : 12;
        FIELD rsv_12                    : 4;
        FIELD mib_type                  : 3;
        FIELD rsv_19                    : 5;
        FIELD mib_read_clr_en           : 1;
        FIELD rsv_25                    : 5;
        FIELD mib_cmd_done              : 1;
        FIELD mib_cmd                   : 1;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_G_MIB_CTRL_STS, *PREG_G_MIB_CTRL_STS;

typedef PACKING union
{
    PACKING struct
    {
        FIELD mib_rdata_l32             : 32;
    } Bits;
    UINT32 Raw;
} REG_G_MIB_RDATA_L32, *PREG_G_MIB_RDATA_L32;

typedef PACKING union
{
    PACKING struct
    {
        FIELD mib_rdata_h32             : 32;
    } Bits;
    UINT32 Raw;
} REG_G_MIB_RDATA_H32, *PREG_G_MIB_RDATA_H32;

typedef PACKING union
{
    PACKING struct
    {
        FIELD mib_wdata_l32             : 32;
    } Bits;
    UINT32 Raw;
} REG_G_MIB_WDATA_L32, *PREG_G_MIB_WDATA_L32;

typedef PACKING union
{
    PACKING struct
    {
        FIELD mib_wdata_h32             : 32;
    } Bits;
    UINT32 Raw;
} REG_G_MIB_WDATA_H32, *PREG_G_MIB_WDATA_H32;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD rsv_9                     : 23;
        FIELD mib_tbl_init_done         : 1;
        FIELD rsv_1                     : 7;
        FIELD mib_tbl_init_start        : 1;
#else
        FIELD mib_tbl_init_start        : 1;
        FIELD rsv_1                     : 7;
        FIELD mib_tbl_init_done         : 1;
        FIELD rsv_9                     : 23;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_G_MIB_TBL_INIT, *PREG_G_MIB_TBL_INIT;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD gpidx_cmd                 : 1;
        FIELD rsv_24                    : 7;
        FIELD gpidx_tbl_addr            : 8;
        FIELD rsv_9                     : 7;
        FIELD gpidx_tbl_wdata           : 9;
#else
        FIELD gpidx_tbl_wdata           : 9;
        FIELD rsv_9                     : 7;
        FIELD gpidx_tbl_addr            : 8;
        FIELD rsv_24                    : 7;
        FIELD gpidx_cmd                 : 1;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_G_GPIDX_TBL_CTRL, *PREG_G_GPIDX_TBL_CTRL;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD gpidx_cmd_done            : 1;
        FIELD rsv_9                     : 22;
        FIELD gpidx_tbl_rdata           : 9;
#else
        FIELD gpidx_tbl_rdata           : 9;
        FIELD rsv_9                     : 22;
        FIELD gpidx_cmd_done            : 1;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_G_GPIDX_TBL_STS, *PREG_G_GPIDX_TBL_STS;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD rsv_9                     : 23;
        FIELD gpidx_tbl_init_done       : 1;
        FIELD rsv_1                     : 7;
        FIELD gpidx_tbl_init_start      : 1;
#else
        FIELD gpidx_tbl_init_start      : 1;
        FIELD rsv_1                     : 7;
        FIELD gpidx_tbl_init_done       : 1;
        FIELD rsv_9                     : 23;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_G_GPIDX_TBL_INIT, *PREG_G_GPIDX_TBL_INIT;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD rsv_9                     : 23;
        FIELD mbi_tx_stop               : 1;
        FIELD rsv_1                     : 7;
        FIELD mbi_rx_stop               : 1;
#else
        FIELD mbi_rx_stop               : 1;
        FIELD rsv_1                     : 7;
        FIELD mbi_tx_stop               : 1;
        FIELD rsv_9                     : 23;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_G_MBI_STOP, *PREG_G_MBI_STOP;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD tcont_cmd                 : 1;
        FIELD rsv_28                    : 3;
        FIELD wr_tcont_id_vld           : 1;
        FIELD rsv_20                    : 7;
        FIELD tcont_id_index            : 4;
        FIELD rsv_12                    : 4;
        FIELD wr_tcont_id               : 12;
#else
        FIELD wr_tcont_id               : 12;
        FIELD rsv_12                    : 4;
        FIELD tcont_id_index            : 4;
        FIELD rsv_20                    : 7;
        FIELD wr_tcont_id_vld           : 1;
        FIELD rsv_28                    : 3;
        FIELD tcont_cmd                 : 1;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_G_TCONT_ID_16_31_CFG, *PREG_G_TCONT_ID_16_31_CFG;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD tcont_cmd_done            : 1;
        FIELD rsv_17                    : 14;
        FIELD rd_tcont_id_vld           : 1;
        FIELD rsv_12                    : 4;
        FIELD rd_tcont_id               : 12;
#else
        FIELD rd_tcont_id               : 12;
        FIELD rsv_12                    : 4;
        FIELD rd_tcont_id_vld           : 1;
        FIELD rsv_17                    : 14;
        FIELD tcont_cmd_done            : 1;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_G_TCONT_ID_16_31_STS, *PREG_G_TCONT_ID_16_31_STS;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD rsv_27                    : 5;
        FIELD mib_frame_type            : 1;
        FIELD gpon_mib_en               : 1;
        FIELD us_no_msg_int_en          : 1;
        FIELD rsv_17                    : 7;
        FIELD rpt_msg_flt               : 1;
        FIELD rsv_12                    : 4;
        FIELD max_rdm_dly               : 12;
#else
        FIELD max_rdm_dly               : 12;
        FIELD rsv_12                    : 4;
        FIELD rpt_msg_flt               : 1;
        FIELD rsv_17                    : 7;
        FIELD us_no_msg_int_en          : 1;
        FIELD gpon_mib_en               : 1;
        FIELD mib_frame_type            : 1;
        FIELD rsv_27                    : 5;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_DBG_CAP_SETTING, *PREG_DBG_CAP_SETTING;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD sch_pref_ofs              : 16;
        FIELD dt_pref_ofs               : 16;
#else
        FIELD dt_pref_ofs               : 16;
        FIELD sch_pref_ofs              : 16;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_DBG_US_PREF_OFS, *PREG_DBG_US_PREF_OFS;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD phy_rx_dly_sel            : 1;
        FIELD rsv_28                    : 3;
        FIELD fix_phy_rx_dly            : 12;
        FIELD fine_int_dly              : 8;
        FIELD phy_tx_dly                : 8;
#else
        FIELD phy_tx_dly                : 8;
        FIELD fine_int_dly              : 8;
        FIELD fix_phy_rx_dly            : 12;
        FIELD rsv_28                    : 3;
        FIELD phy_rx_dly_sel            : 1;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_DBG_DLY, *PREG_DBG_DLY;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD rsv_16                    : 16;
        FIELD idle_gem_thld             : 16;
#else
        FIELD idle_gem_thld             : 16;
        FIELD rsv_16                    : 16;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_DBG_IDLE_GEM_THLD, *PREG_DBG_IDLE_GEM_THLD;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD us_no_msg_b3_b4           : 16;
        FIELD us_no_msg_type            : 8;
        FIELD rsv_0                     : 8;
#else
        FIELD rsv_0                     : 8;
        FIELD us_no_msg_type            : 8;
        FIELD us_no_msg_b3_b4           : 16;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_DBG_US_NO_MSG0, *PREG_DBG_US_NO_MSG0;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD us_no_msg_b5_b6           : 16;
        FIELD us_no_msg_b7_b8           : 16;
#else
        FIELD us_no_msg_b7_b8           : 16;
        FIELD us_no_msg_b5_b6           : 16;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_DBG_US_NO_MSG1, *PREG_DBG_US_NO_MSG1;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD us_no_msg_b9_b10          : 16;
        FIELD us_no_msg_b11_b12         : 16;
#else
        FIELD us_no_msg_b11_b12         : 16;
        FIELD us_no_msg_b9_b10          : 16;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_DBG_US_NO_MSG2, *PREG_DBG_US_NO_MSG2;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD rsv_28                    : 4;
        FIELD dying_gasp_num            : 4;
        FIELD rsv_17                    : 7;
        FIELD dying_gasp_test           : 1;
        FIELD rsv_9                     : 7;
        FIELD hw_dying_gasp_en          : 1;
        FIELD dying_gasp_msg_type       : 8;
#else
        FIELD dying_gasp_msg_type       : 8;
        FIELD hw_dying_gasp_en          : 1;
        FIELD rsv_9                     : 7;
        FIELD dying_gasp_test           : 1;
        FIELD rsv_17                    : 7;
        FIELD dying_gasp_num            : 4;
        FIELD rsv_28                    : 4;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_DBG_US_DYING_GASP_CTRL, *PREG_DBG_US_DYING_GASP_CTRL;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD bwm_intvl_invld           : 1;
        FIELD bwm_len_invld             : 1;
        FIELD bwm_start_order_err       : 1;
        FIELD rsv_19                    : 10;
        FIELD bwm_start_order_err_flt_en : 1;
        FIELD bwm_len_vld_chk_en        : 1;
        FIELD min_bst_intvl_en          : 1;
        FIELD min_bst_intvl             : 16;
#else
        FIELD min_bst_intvl             : 16;
        FIELD min_bst_intvl_en          : 1;
        FIELD bwm_len_vld_chk_en        : 1;
        FIELD bwm_start_order_err_flt_en : 1;
        FIELD rsv_19                    : 10;
        FIELD bwm_start_order_err       : 1;
        FIELD bwm_len_invld             : 1;
        FIELD bwm_intvl_invld           : 1;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_DBG_BWM_FILTER_CTRL, *PREG_DBG_BWM_FILTER_CTRL;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD rsv_25                    : 7;
        FIELD bwm_sfifo_max_used        : 9;
        FIELD rsv_9                     : 7;
        FIELD bwm_sfifo_used            : 9;
#else
        FIELD bwm_sfifo_used            : 9;
        FIELD rsv_9                     : 7;
        FIELD bwm_sfifo_max_used        : 9;
        FIELD rsv_25                    : 7;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_DBG_BWM_SFIFO_STS, *PREG_DBG_BWM_SFIFO_STS;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD rsv_22                    : 10;
        FIELD ether_fcs_err             : 1;
        FIELD ploamu_wr                 : 1;
        FIELD dbru_wr                   : 1;
        FIELD is_gem_pl                 : 1;
        FIELD is_fcs_only               : 1;
        FIELD is_inst_idle              : 1;
        FIELD rsv_6                     : 10;
        FIELD mbi_pl_fifo_ovrn          : 1;
        FIELD aes_egn3_busy             : 1;
        FIELD aes_egn2_busy             : 1;
        FIELD aes_egn1_busy             : 1;
        FIELD aes_egn0_busy             : 1;
        FIELD aes_rdm_ciph_fifo_ovrn    : 1;
#else
        FIELD aes_rdm_ciph_fifo_ovrn    : 1;
        FIELD aes_egn0_busy             : 1;
        FIELD aes_egn1_busy             : 1;
        FIELD aes_egn2_busy             : 1;
        FIELD aes_egn3_busy             : 1;
        FIELD mbi_pl_fifo_ovrn          : 1;
        FIELD rsv_6                     : 10;
        FIELD is_inst_idle              : 1;
        FIELD is_fcs_only               : 1;
        FIELD is_gem_pl                 : 1;
        FIELD dbru_wr                   : 1;
        FIELD ploamu_wr                 : 1;
        FIELD ether_fcs_err             : 1;
        FIELD rsv_22                    : 10;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_DBG_GRP_0, *PREG_DBG_GRP_0;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD rsv_25                    : 7;
        FIELD alen_neq_zero             : 1;
        FIELD rsv_20                    : 4;
        FIELD tx_align_fifo_udrn        : 1;
        FIELD rx_sof_sync               : 1;
        FIELD sync_start                : 1;
        FIELD tx_late_start             : 1;
        FIELD rsv_9                     : 7;
        FIELD bst_next_full             : 1;
        FIELD sgl_next_full             : 1;
        FIELD aes_cryp_cnt_fifo_ovrn    : 1;
        FIELD aes_ciph_txt_fifo_ovrn    : 1;
        FIELD mbi_hdr_fifo_ovrn         : 1;
        FIELD ploamd_crc_err            : 1;
        FIELD bwm_uc_err                : 1;
        FIELD blen_err                  : 1;
        FIELD logd                      : 1;
#else
        FIELD logd                      : 1;
        FIELD blen_err                  : 1;
        FIELD bwm_uc_err                : 1;
        FIELD ploamd_crc_err            : 1;
        FIELD mbi_hdr_fifo_ovrn         : 1;
        FIELD aes_ciph_txt_fifo_ovrn    : 1;
        FIELD aes_cryp_cnt_fifo_ovrn    : 1;
        FIELD sgl_next_full             : 1;
        FIELD bst_next_full             : 1;
        FIELD rsv_9                     : 7;
        FIELD tx_late_start             : 1;
        FIELD sync_start                : 1;
        FIELD rx_sof_sync               : 1;
        FIELD tx_align_fifo_udrn        : 1;
        FIELD rsv_20                    : 4;
        FIELD alen_neq_zero             : 1;
        FIELD rsv_25                    : 7;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_DBG_GRP_1, *PREG_DBG_GRP_1;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD rsv_16                    : 16;
        FIELD tx_align_max_used         : 16;
#else
        FIELD tx_align_max_used         : 16;
        FIELD rsv_16                    : 16;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_DBG_TXFIFO_MAX_USED, *PREG_DBG_TXFIFO_MAX_USED;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD rsv_20                    : 12;
        FIELD pls_used                  : 1;
        FIELD dba_mode2_used            : 1;
        FIELD dba_mode1_used            : 1;
        FIELD dba_mode0_used            : 1;
        FIELD rsv_8                     : 8;
        FIELD max_assigned_gnt_num      : 8;
#else
        FIELD max_assigned_gnt_num      : 8;
        FIELD rsv_8                     : 8;
        FIELD dba_mode0_used            : 1;
        FIELD dba_mode1_used            : 1;
        FIELD dba_mode2_used            : 1;
        FIELD pls_used                  : 1;
        FIELD rsv_20                    : 12;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_DBG_BWM_GNT_STS, *PREG_DBG_BWM_GNT_STS;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD rsv_25                    : 7;
        FIELD gpon_sub_probe_sel        : 5;
        FIELD probe_bit0_sel            : 4;
        FIELD bwm_probe_sel             : 4;
        FIELD tx_align_probe_dt_sel     : 1;
        FIELD rx_mpi_mbi_probe_dt_sel   : 1;
        FIELD tx_mpi_mbi_probe_dt_sel   : 1;
        FIELD rx_data_hl_sel            : 1;
        FIELD rsv_5                     : 3;
        FIELD probe_sel                 : 5;
#else
        FIELD probe_sel                 : 5;
        FIELD rsv_5                     : 3;
        FIELD rx_data_hl_sel            : 1;
        FIELD tx_mpi_mbi_probe_dt_sel   : 1;
        FIELD rx_mpi_mbi_probe_dt_sel   : 1;
        FIELD tx_align_probe_dt_sel     : 1;
        FIELD bwm_probe_sel             : 4;
        FIELD probe_bit0_sel            : 4;
        FIELD gpon_sub_probe_sel        : 5;
        FIELD rsv_25                    : 7;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_DBG_PROBE_CTRL, *PREG_DBG_PROBE_CTRL;

typedef PACKING union
{
    PACKING struct
    {
        FIELD probe_high32              : 32;
    } Bits;
    UINT32 Raw;
} REG_DBG_PROBE_HIGH32, *PREG_DBG_PROBE_HIGH32;

typedef PACKING union
{
    PACKING struct
    {
        FIELD probe_low32               : 32;
    } Bits;
    UINT32 Raw;
} REG_DBG_PROBE_LOW32, *PREG_DBG_PROBE_LOW32;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD rsv_25                    : 7;
        FIELD bwm_bfifo_max_used        : 9;
        FIELD rsv_9                     : 7;
        FIELD bwm_bfifo_used            : 9;
#else
        FIELD bwm_bfifo_used            : 9;
        FIELD rsv_9                     : 7;
        FIELD bwm_bfifo_max_used        : 9;
        FIELD rsv_25                    : 7;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_DBG_BWM_BFIFO_STS, *PREG_DBG_BWM_BFIFO_STS;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD rsv_10                    : 22;
        FIELD bwm_fec_ctrl              : 1;
        FIELD ignore_atm_cell           : 1;
        FIELD rsv_5                     : 3;
        FIELD o5_eqd_adj_resync_en      : 1;
        FIELD tx_udrn_resync_en         : 1;
        FIELD tx_late_resync_en         : 1;
        FIELD bst_sgl_diff_resync_en    : 1;
        FIELD ignore_ploamd_crc         : 1;
#else
        FIELD ignore_ploamd_crc         : 1;
        FIELD bst_sgl_diff_resync_en    : 1;
        FIELD tx_late_resync_en         : 1;
        FIELD tx_udrn_resync_en         : 1;
        FIELD o5_eqd_adj_resync_en      : 1;
        FIELD rsv_5                     : 3;
        FIELD ignore_atm_cell           : 1;
        FIELD bwm_fec_ctrl              : 1;
        FIELD rsv_10                    : 22;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_DBG_ERR_CTRL, *PREG_DBG_ERR_CTRL;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD rsv_9                     : 23;
        FIELD rdi_en                    : 1;
        FIELD rsv_1                     : 7;
        FIELD sw_rdi                    : 1;
#else
        FIELD sw_rdi                    : 1;
        FIELD rsv_1                     : 7;
        FIELD rdi_en                    : 1;
        FIELD rsv_9                     : 23;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_DBG_SW_RDI_CTRL, *PREG_DBG_SW_RDI_CTRL;

typedef PACKING union
{
    PACKING struct
    {
        FIELD dbg_rx_gem_cnt            : 32;
    } Bits;
    UINT32 Raw;
} REG_DBG_RX_GEM_CNT, *PREG_DBG_RX_GEM_CNT;

typedef PACKING union
{
    PACKING struct
    {
        FIELD dbg_rx_crc_cnt            : 32;
    } Bits;
    UINT32 Raw;
} REG_DBG_RX_CRC_ERR_CNT, *PREG_DBG_RX_CRC_ERR_CNT;

typedef PACKING union
{
    PACKING struct
    {
        FIELD dbg_rx_gtc_cnt            : 32;
    } Bits;
    UINT32 Raw;
} REG_DBG_RX_GTC_CNT, *PREG_DBG_RX_GTC_CNT;

typedef PACKING union
{
    PACKING struct
    {
        FIELD dbg_tx_gem_cnt            : 32;
    } Bits;
    UINT32 Raw;
} REG_DBG_TX_GEM_CNT, *PREG_DBG_TX_GEM_CNT;

typedef PACKING union
{
    PACKING struct
    {
        FIELD dbg_tx_burst_cnt          : 32;
    } Bits;
    UINT32 Raw;
} REG_DBG_TX_BST_CNT, *PREG_DBG_TX_BST_CNT;

typedef PACKING union
{
    PACKING struct
    {
        FIELD dbg_gem_one_err_cnt       : 32;
    } Bits;
    UINT32 Raw;
} REG_DBG_GEM_HEC_ONE_ERR_CNT, *PREG_DBG_GEM_HEC_ONE_ERR_CNT;

typedef PACKING union
{
    PACKING struct
    {
        FIELD dbg_gem_two_err_cnt       : 32;
    } Bits;
    UINT32 Raw;
} REG_DBG_GEM_HEC_TWO_ERR_CNT, *PREG_DBG_GEM_HEC_TWO_ERR_CNT;

typedef PACKING union
{
    PACKING struct
    {
        FIELD dbg_gem_uc_err_cnt        : 32;
    } Bits;
    UINT32 Raw;
} REG_DBG_GEM_HEC_UC_ERR_CNT, *PREG_DBG_GEM_HEC_UC_ERR_CNT;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD dbg_sw_rpt_dba_en         : 1;
        FIELD rsv_28                    : 3;
        FIELD dbg_slight_modify_en      : 1;
        FIELD rsv_0                     : 27;
#else
        FIELD rsv_0                     : 27;
        FIELD dbg_slight_modify_en      : 1;
        FIELD rsv_28                    : 3;
        FIELD dbg_sw_rpt_dba_en         : 1;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_DBG_DBA_BACK_DOOR, *PREG_DBG_DBA_BACK_DOOR;

typedef PACKING union
{
    PACKING struct
    {
        FIELD dbg_dba_total_buf_size    : 32;
    } Bits;
    UINT32 Raw;
} REG_DBG_DBA_TOTAL_BUF_SIZE, *PREG_DBG_DBA_TOTAL_BUF_SIZE;

typedef PACKING union
{
    PACKING struct
    {
        FIELD dbg_dba_green_size        : 32;
    } Bits;
    UINT32 Raw;
} REG_DBG_DBA_GREEN_SIZE, *PREG_DBG_DBA_GREEN_SIZE;

typedef PACKING union
{
    PACKING struct
    {
        FIELD dbg_dba_yellow_size       : 32;
    } Bits;
    UINT32 Raw;
} REG_DBG_DBA_YELLOW_SIZE, *PREG_DBG_DBA_YELLOW_SIZE;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD dbg_yellow_slight_modify_size : 16;
        FIELD dbg_green_slight_modify_size : 16;
#else
        FIELD dbg_green_slight_modify_size : 16;
        FIELD dbg_yellow_slight_modify_size : 16;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_DBG_SLIGHT_MODIFY_SIZE_1, *PREG_DBG_SLIGHT_MODIFY_SIZE_1;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD rsv_16                    : 16;
        FIELD dbg_total_slight_modify_size : 16;
#else
        FIELD dbg_total_slight_modify_size : 16;
        FIELD rsv_16                    : 16;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_DBG_SLIGHT_MODIFY_SIZE_2, *PREG_DBG_SLIGHT_MODIFY_SIZE_2;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD rsv_30                    : 2;
        FIELD dbg_ds_spf_cnt            : 30;
#else
        FIELD dbg_ds_spf_cnt            : 30;
        FIELD rsv_30                    : 2;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_DBG_DS_SPF_CNT, *PREG_DBG_DS_SPF_CNT;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD rsv_2                     : 30;
        FIELD dbg_tx_sync_offset        : 2;
#else
        FIELD dbg_tx_sync_offset        : 2;
        FIELD rsv_2                     : 30;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_DBG_TX_SYNC_OFFSET, *PREG_DBG_TX_SYNC_OFFSET;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD rsv_9                     : 23;
        FIELD dbg_ext_bst_len_filter_in_o5_en : 1;
        FIELD rsv_1                     : 7;
        FIELD dbg_us_overhead_filter_in_o5_en : 1;
#else
        FIELD dbg_us_overhead_filter_in_o5_en : 1;
        FIELD rsv_1                     : 7;
        FIELD dbg_ext_bst_len_filter_in_o5_en : 1;
        FIELD rsv_9                     : 23;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_DBG_PLOAMD_FILTER_IN_O5, *PREG_DBG_PLOAMD_FILTER_IN_O5;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD dbg_sw_resync_en          : 1;
        FIELD rsv_1                     : 30;
        FIELD dbg_sw_resync             : 1;
#else
        FIELD dbg_sw_resync             : 1;
        FIELD rsv_1                     : 30;
        FIELD dbg_sw_resync_en          : 1;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_DBG_SW_RESYNC, *PREG_DBG_SW_RESYNC;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD sniff_dbg_tx_rst          : 1;
        FIELD rsv_9                     : 22;
        FIELD sniff_pkt_padding_en      : 1;
        FIELD rsv_1                     : 7;
        FIELD dbg_gtc_eth_extr_en       : 1;
#else
        FIELD dbg_gtc_eth_extr_en       : 1;
        FIELD rsv_1                     : 7;
        FIELD sniff_pkt_padding_en      : 1;
        FIELD rsv_9                     : 22;
        FIELD sniff_dbg_tx_rst          : 1;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_DBG_GTC_ETH_EXTR, *PREG_DBG_GTC_ETH_EXTR;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD dbg_extr_rx_ds_eth_type   : 16;
        FIELD dbg_extr_rx_ds_sp         : 16;
#else
        FIELD dbg_extr_rx_ds_sp         : 16;
        FIELD dbg_extr_rx_ds_eth_type   : 16;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_DBG_DS_GTC_EXTR_ETH_HDR, *PREG_DBG_DS_GTC_EXTR_ETH_HDR;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD dbg_extr_tx_us_eth_type   : 16;
        FIELD dbg_extr_tx_us_sp         : 16;
#else
        FIELD dbg_extr_tx_us_sp         : 16;
        FIELD dbg_extr_tx_us_eth_type   : 16;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_DBG_US_GTC_EXTR_ETH_HDR, *PREG_DBG_US_GTC_EXTR_ETH_HDR;

typedef PACKING union
{
    PACKING struct
    {
        FIELD dbg_extr_rx_cnt           : 32;
    } Bits;
    UINT32 Raw;
} REG_DBG_DS_GTC_EXTR_ETH_CNT, *PREG_DBG_DS_GTC_EXTR_ETH_CNT;

typedef PACKING union
{
    PACKING struct
    {
        FIELD dbg_extr_tx_cnt           : 32;
    } Bits;
    UINT32 Raw;
} REG_DBG_US_GTC_EXTR_ETH_CNT, *PREG_DBG_US_GTC_EXTR_ETH_CNT;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD dbg_ds_all_gem_filter     : 1;
        FIELD rsv_28                    : 3;
        FIELD dbg_ds_gem_filter_exclude_omci : 1;
        FIELD rsv_16                    : 11;
        FIELD dbg_us_gtc_invld_gem_byte : 16;
#else
        FIELD dbg_us_gtc_invld_gem_byte : 16;
        FIELD rsv_16                    : 11;
        FIELD dbg_ds_gem_filter_exclude_omci : 1;
        FIELD rsv_28                    : 3;
        FIELD dbg_ds_all_gem_filter     : 1;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_SNIFF_GTC_GTC_INVLD_GEM_BYTE, *PREG_SNIFF_GTC_GTC_INVLD_GEM_BYTE;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD rsv_17                    : 15;
        FIELD dbg_mbi_pl_fifo_write_conflict : 1;
        FIELD rsv_9                     : 7;
        FIELD dbg_mbi_hdr_fifo_write_conflict : 1;
        FIELD rsv_1                     : 7;
        FIELD dbg_us_gtc_info_fifo_ovrn : 1;
#else
        FIELD dbg_us_gtc_info_fifo_ovrn : 1;
        FIELD rsv_1                     : 7;
        FIELD dbg_mbi_hdr_fifo_write_conflict : 1;
        FIELD rsv_9                     : 7;
        FIELD dbg_mbi_pl_fifo_write_conflict : 1;
        FIELD rsv_17                    : 15;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_DBG_SNIFF_DBG_REG, *PREG_DBG_SNIFF_DBG_REG;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD rsv_7                     : 25;
        FIELD dbg_us_info_tx_send_depth : 7;
#else
        FIELD dbg_us_info_tx_send_depth : 7;
        FIELD rsv_7                     : 25;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_DBG_SNIFF_US_INFO_FIFO, *PREG_DBG_SNIFF_US_INFO_FIFO;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD stop_time_of_wido_en      : 1;
        FIELD rsv_16                    : 15;
        FIELD stop_time_of_wido         : 16;
#else
        FIELD stop_time_of_wido         : 16;
        FIELD rsv_16                    : 15;
        FIELD stop_time_of_wido_en      : 1;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_SNIFF_US_HDR_WIDO, *PREG_SNIFF_US_HDR_WIDO;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD tx_us_da_h16              : 16;
        FIELD tx_us_sa_h16              : 16;
#else
        FIELD tx_us_sa_h16              : 16;
        FIELD tx_us_da_h16              : 16;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_SNIFF_TX_DA_SA, *PREG_SNIFF_TX_DA_SA;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD rx_ds_da_h16              : 16;
        FIELD rx_ds_sa_h16              : 16;
#else
        FIELD rx_ds_sa_h16              : 16;
        FIELD rx_ds_da_h16              : 16;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_SNIFF_RX_DA_SA, *PREG_SNIFF_RX_DA_SA;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD rsv_28                    : 4;
        FIELD tx_eth_pid                : 12;
        FIELD rsv_12                    : 4;
        FIELD rx_eth_pid                : 12;
#else
        FIELD rx_eth_pid                : 12;
        FIELD rsv_12                    : 4;
        FIELD tx_eth_pid                : 12;
        FIELD rsv_28                    : 4;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_SNIFF_TX_RX_PID, *PREG_SNIFF_TX_RX_PID;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD rsv_1                     : 31;
        FIELD sniff_cnt_en              : 1;
#else
        FIELD sniff_cnt_en              : 1;
        FIELD rsv_1                     : 31;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_SNIFF_CNT_EN, *PREG_SNIFF_CNT_EN;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD sniff_rx_tpid             : 16;
        FIELD sniff_tx_tpid             : 16;
#else
        FIELD sniff_tx_tpid             : 16;
        FIELD sniff_rx_tpid             : 16;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_SNIFF_RX_TX_TPID, *PREG_SNIFF_RX_TX_TPID;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD asb_tx_eth_4byte_align_en : 1;
        FIELD rsv_28                    : 3;
        FIELD olt_ds_fec                : 1;
        FIELD rsv_24                    : 3;
        FIELD onu_us_fec                : 1;
        FIELD rsv_1                     : 22;
        FIELD gpon_mac_sw_rst_n         : 1;
#else
        FIELD gpon_mac_sw_rst_n         : 1;
        FIELD rsv_1                     : 22;
        FIELD onu_us_fec                : 1;
        FIELD rsv_24                    : 3;
        FIELD olt_ds_fec                : 1;
        FIELD rsv_28                    : 3;
        FIELD asb_tx_eth_4byte_align_en : 1;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_DBG_GPON_MAC_SET, *PREG_DBG_GPON_MAC_SET;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD sleep_filt_all_bwm        : 1;
        FIELD reload_sleep_cnt          : 1;
        FIELD rsv_0                     : 30;
#else
        FIELD rsv_0                     : 30;
        FIELD reload_sleep_cnt          : 1;
        FIELD sleep_filt_all_bwm        : 1;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_SLEEP_GLB_CFG, *PREG_SLEEP_GLB_CFG;

typedef PACKING union
{
    PACKING struct
    {
        FIELD sleep_cnt                 : 32;
    } Bits;
    UINT32 Raw;
} REG_SLEEP_CNT, *PREG_SLEEP_CNT;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD rsv_1                     : 31;
        FIELD tx_sync_opt               : 1;
#else
        FIELD tx_sync_opt               : 1;
        FIELD rsv_1                     : 31;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_TX_SYNC_OPT, *PREG_TX_SYNC_OPT;

typedef PACKING union
{
    PACKING struct
    {
#ifdef __BIG_ENDIAN
        FIELD rsv_9                     : 23;
        FIELD ploamu_ind_ctrl           : 1;
        FIELD rsv_1                     : 7;
        FIELD o3_o4_ploamu_ctrl         : 1;
#else
        FIELD o3_o4_ploamu_ctrl         : 1;
        FIELD rsv_1                     : 7;
        FIELD ploamu_ind_ctrl           : 1;
        FIELD rsv_9                     : 23;
#endif /* __BIG_ENDIAN */
    } Bits;
    UINT32 Raw;
} REG_PLOAMU_CTRL, *PREG_PLOAMU_CTRL;

typedef PACKING union
{
    PACKING struct
    {
        FIELD tod_1pps_width_ctrl       : 32;
    } Bits;
    UINT32 Raw;
} REG_TOD_1PPS_WD_CTRL, *PREG_TOD_1PPS_WD_CTRL;

// ----------------- gpon_mac_reg  Grouping Definitions -------------------
// ----------------- gpon_mac_reg Register Definition -------------------
typedef volatile PACKING struct
{
    UINT32                          rsv_0000[4096];   // 0000..3FFC
    REG_G_ONU_ID                    G_ONU_ID;         // 4000
    REG_G_GBL_CFG                   G_GBL_CFG;        // 4004
    REG_G_INT_STATUS                G_INT_STATUS;     // 4008
    REG_G_INT_ENABLE                G_INT_ENABLE;     // 400C
    UINT32                          rsv_4010[4];      // 4010..401C
    REG_G_TCONT_ID_0_1              G_TCONT_ID_0_1;   // 4020
    REG_G_TCONT_ID_2_3              G_TCONT_ID_2_3;   // 4024
    REG_G_TCONT_ID_4_5              G_TCONT_ID_4_5;   // 4028
    REG_G_TCONT_ID_6_7              G_TCONT_ID_6_7;   // 402C
    REG_G_TCONT_ID_8_9              G_TCONT_ID_8_9;   // 4030
    REG_G_TCONT_ID_10_11            G_TCONT_ID_10_11; // 4034
    REG_G_TCONT_ID_12_13            G_TCONT_ID_12_13; // 4038
    REG_G_TCONT_ID_14_15            G_TCONT_ID_14_15; // 403C
    REG_G_GEM_PORT_CFG              G_GEM_PORT_CFG;   // 4040
    REG_G_GEM_PORT_STS              G_GEM_PORT_STS;   // 4044
    REG_G_OMCI_ID                   G_OMCI_ID;        // 4048
    REG_G_GEM_TBL_INIT              G_GEM_TBL_INIT;   // 404C
    REG_G_PLOAMu_FIFO_STS           G_PLOAMu_FIFO_STS; // 4050
    REG_G_PLOAMu_WDATA              G_PLOAMu_WDATA;   // 4054
    REG_G_PLOAMd_FIFO_STS           G_PLOAMd_FIFO_STS; // 4058
    REG_G_PLOAMd_RDATA              G_PLOAMd_RDATA;   // 405C
    REG_G_AES_CFG                   G_AES_CFG;        // 4060
    REG_G_AES_ACTIVE_KEY0           G_AES_ACTIVE_KEY0; // 4064
    REG_G_AES_ACTIVE_KEY1           G_AES_ACTIVE_KEY1; // 4068
    REG_G_AES_ACTIVE_KEY2           G_AES_ACTIVE_KEY2; // 406C
    REG_G_AES_ACTIVE_KEY3           G_AES_ACTIVE_KEY3; // 4070
    REG_G_AES_SHADOW_KEY0           G_AES_SHADOW_KEY0; // 4074
    REG_G_AES_SHADOW_KEY1           G_AES_SHADOW_KEY1; // 4078
    REG_G_AES_SHADOW_KEY2           G_AES_SHADOW_KEY2; // 407C
    REG_G_AES_SHADOW_KEY3           G_AES_SHADOW_KEY3; // 4080
    REG_G_AES_KEY_SWITCH_BY_SW      G_AES_KEY_SWITCH_BY_SW; // 4084
    UINT32                          rsv_4088[2];      // 4088..408C
    REG_G_PLOu_OVERHEAD             G_PLOu_OVERHEAD;  // 4090
    REG_G_PLOu_GUARD_BIT            G_PLOu_GUARD_BIT; // 4094
    REG_G_PLOu_PRMBL_TYPE1_2        G_PLOu_PRMBL_TYPE1_2; // 4098
    REG_G_PLOu_PRMBL_TYPE3          G_PLOu_PRMBL_TYPE3; // 409C
    REG_G_PLOu_DELM_BIT             G_PLOu_DELM_BIT;  // 40A0
    REG_G_PRE_ASSIGNED_DLY          G_PRE_ASSIGNED_DLY; // 40A4
    REG_G_EQD                       G_EQD;            // 40A8
    REG_G_RSP_TIME                  G_RSP_TIME;       // 40AC
    REG_G_VENDOR_ID                 G_VENDOR_ID;      // 40B0
    REG_G_VS_SN                     G_VS_SN;          // 40B4
    REG_G_SN_MSG_CFG                G_SN_MSG_CFG;     // 40B8
    REG_G_ACTIVATION_ST             G_ACTIVATION_ST;  // 40BC
    UINT32                          rsv_40C0[4];      // 40C0..40CC
    REG_G_TOD_CFG                   G_TOD_CFG;        // 40D0
    REG_G_NEW_TOD_SEC_L32           G_NEW_TOD_SEC_L32; // 40D4
    REG_G_NEW_TOD_NANO_SEC          G_NEW_TOD_NANO_SEC; // 40D8
    REG_G_CUR_TOD_SEC_L32           G_CUR_TOD_SEC_L32; // 40DC
    REG_G_CUR_TOD_NANO_SEC          G_CUR_TOD_NANO_SEC; // 40E0
    REG_G_TOD_CLK_PERIOD            G_TOD_CLK_PERIOD; // 40E4
    UINT32                          rsv_40E8[6];      // 40E8..40FC
    REG_G_TX_FCS_TBL_INIT           G_TX_FCS_TBL_INIT; // 4100
    UINT32                          rsv_4104[7];      // 4104..411C
    REG_G_MIB_CTRL_STS              G_MIB_CTRL_STS;   // 4120
    REG_G_MIB_RDATA_L32             G_MIB_RDATA_L32;  // 4124
    REG_G_MIB_RDATA_H32             G_MIB_RDATA_H32;  // 4128
    REG_G_MIB_WDATA_L32             G_MIB_WDATA_L32;  // 412C
    REG_G_MIB_WDATA_H32             G_MIB_WDATA_H32;  // 4130
    REG_G_MIB_TBL_INIT              G_MIB_TBL_INIT;   // 4134
    UINT32                          rsv_4138[2];      // 4138..413C
    REG_G_GPIDX_TBL_CTRL            G_GPIDX_TBL_CTRL; // 4140
    REG_G_GPIDX_TBL_STS             G_GPIDX_TBL_STS;  // 4144
    REG_G_GPIDX_TBL_INIT            G_GPIDX_TBL_INIT; // 4148
    UINT32                          rsv_414C[5];      // 414C..415C
    REG_G_MBI_STOP                  G_MBI_STOP;       // 4160
    UINT32                          rsv_4164[7];      // 4164..417C
    REG_G_TCONT_ID_16_31_CFG        G_TCONT_ID_16_31_CFG; // 4180
    REG_G_TCONT_ID_16_31_STS        G_TCONT_ID_16_31_STS; // 4184
    UINT32                          rsv_4188[30];     // 4188..41FC
    REG_DBG_CAP_SETTING             DBG_CAP_SETTING;  // 4200
    REG_DBG_US_PREF_OFS             DBG_US_PREF_OFS;  // 4204
    REG_DBG_DLY                     DBG_DLY;          // 4208
    REG_DBG_IDLE_GEM_THLD           DBG_IDLE_GEM_THLD; // 420C
    REG_DBG_US_NO_MSG0              DBG_US_NO_MSG0;   // 4210
    REG_DBG_US_NO_MSG1              DBG_US_NO_MSG1;   // 4214
    REG_DBG_US_NO_MSG2              DBG_US_NO_MSG2;   // 4218
    REG_DBG_US_DYING_GASP_CTRL      DBG_US_DYING_GASP_CTRL; // 421C
    REG_DBG_BWM_FILTER_CTRL         DBG_BWM_FILTER_CTRL; // 4220
    REG_DBG_BWM_SFIFO_STS           DBG_BWM_SFIFO_STS; // 4224
    REG_DBG_GRP_0                   DBG_GRP_0;        // 4228
    REG_DBG_GRP_1                   DBG_GRP_1;        // 422C
    REG_DBG_TXFIFO_MAX_USED         DBG_TXFIFO_MAX_USED; // 4230
    REG_DBG_BWM_GNT_STS             DBG_BWM_GNT_STS;  // 4234
    UINT32                          rsv_4238[2];      // 4238..423C
    REG_DBG_PROBE_CTRL              DBG_PROBE_CTRL;   // 4240
    REG_DBG_PROBE_HIGH32            DBG_PROBE_HIGH32; // 4244
    REG_DBG_PROBE_LOW32             DBG_PROBE_LOW32;  // 4248
    UINT32                          rsv_424C;         // 424C
    REG_DBG_BWM_BFIFO_STS           DBG_BWM_BFIFO_STS; // 4250
    UINT32                          rsv_4254[3];      // 4254..425C
    REG_DBG_ERR_CTRL                DBG_ERR_CTRL;     // 4260
    REG_DBG_SW_RDI_CTRL             DBG_SW_RDI_CTRL;  // 4264
    UINT32                          rsv_4268[38];     // 4268..42FC
    REG_DBG_RX_GEM_CNT              DBG_RX_GEM_CNT;   // 4300
    REG_DBG_RX_CRC_ERR_CNT          DBG_RX_CRC_ERR_CNT; // 4304
    REG_DBG_RX_GTC_CNT              DBG_RX_GTC_CNT;   // 4308
    REG_DBG_TX_GEM_CNT              DBG_TX_GEM_CNT;   // 430C
    REG_DBG_TX_BST_CNT              DBG_TX_BST_CNT;   // 4310
    UINT32                          rsv_4314[7];      // 4314..432C
    REG_DBG_GEM_HEC_ONE_ERR_CNT     DBG_GEM_HEC_ONE_ERR_CNT; // 4330
    REG_DBG_GEM_HEC_TWO_ERR_CNT     DBG_GEM_HEC_TWO_ERR_CNT; // 4334
    REG_DBG_GEM_HEC_UC_ERR_CNT      DBG_GEM_HEC_UC_ERR_CNT; // 4338
    UINT32                          rsv_433C;         // 433C
    REG_DBG_DBA_BACK_DOOR           DBG_DBA_BACK_DOOR; // 4340
    REG_DBG_DBA_TOTAL_BUF_SIZE      DBG_DBA_TOTAL_BUF_SIZE; // 4344
    REG_DBG_DBA_GREEN_SIZE          DBG_DBA_GREEN_SIZE; // 4348
    REG_DBG_DBA_YELLOW_SIZE         DBG_DBA_YELLOW_SIZE; // 434C
    REG_DBG_SLIGHT_MODIFY_SIZE_1    DBG_SLIGHT_MODIFY_SIZE_1; // 4350
    REG_DBG_SLIGHT_MODIFY_SIZE_2    DBG_SLIGHT_MODIFY_SIZE_2; // 4354
    REG_DBG_DS_SPF_CNT              DBG_DS_SPF_CNT;   // 4358
    REG_DBG_TX_SYNC_OFFSET          DBG_TX_SYNC_OFFSET; // 435C
    REG_DBG_PLOAMD_FILTER_IN_O5     DBG_PLOAMD_FILTER_IN_O5; // 4360
    REG_DBG_SW_RESYNC               DBG_SW_RESYNC;    // 4364
    REG_DBG_GTC_ETH_EXTR            DBG_GTC_ETH_EXTR; // 4368
    REG_DBG_DS_GTC_EXTR_ETH_HDR     DBG_DS_GTC_EXTR_ETH_HDR; // 436C
    REG_DBG_US_GTC_EXTR_ETH_HDR     DBG_US_GTC_EXTR_ETH_HDR; // 4370
    REG_DBG_DS_GTC_EXTR_ETH_CNT     DBG_DS_GTC_EXTR_ETH_CNT; // 4374
    REG_DBG_US_GTC_EXTR_ETH_CNT     DBG_US_GTC_EXTR_ETH_CNT; // 4378
    REG_SNIFF_GTC_GTC_INVLD_GEM_BYTE SNIFF_GTC_GTC_INVLD_GEM_BYTE; // 437C
    REG_DBG_SNIFF_DBG_REG           DBG_SNIFF_DBG_REG; // 4380
    REG_DBG_SNIFF_US_INFO_FIFO      DBG_SNIFF_US_INFO_FIFO; // 4384
    REG_SNIFF_US_HDR_WIDO           SNIFF_US_HDR_WIDO; // 4388
    REG_SNIFF_TX_DA_SA              SNIFF_TX_DA_SA;   // 438C
    REG_SNIFF_RX_DA_SA              SNIFF_RX_DA_SA;   // 4390
    REG_SNIFF_TX_RX_PID             SNIFF_TX_RX_PID;  // 4394
    REG_SNIFF_CNT_EN                SNIFF_CNT_EN;     // 4398
    REG_SNIFF_RX_TX_TPID            SNIFF_RX_TX_TPID; // 439C
    REG_DBG_GPON_MAC_SET            DBG_GPON_MAC_SET; // 43A0
    REG_SLEEP_GLB_CFG               SLEEP_GLB_CFG;    // 43A4
    REG_SLEEP_CNT                   SLEEP_CNT;        // 43A8
    UINT32                          rsv_43AC[5];      // 43AC..43BC
    REG_TX_SYNC_OPT                 TX_SYNC_OPT;      // 43C0
    REG_PLOAMU_CTRL                 PLOAMU_CTRL;      // 43C4
    REG_TOD_1PPS_WD_CTRL            TOD_1PPS_WD_CTRL; // 43C8
}gpon_mac_reg_REGS, *Pgpon_mac_reg_REGS;

// ---------- gpon_mac_reg Enum Definitions      ----------
// ---------- gpon_mac_reg C Macro Definitions   ----------
extern Pgpon_mac_reg_REGS g_gpon_mac_reg_BASE;

#define gpon_mac_reg_BASE                                      (g_gpon_mac_reg_BASE)

#define G_ONU_ID                                               INREG32(&gpon_mac_reg_BASE->G_ONU_ID) // 4000
#define G_GBL_CFG                                              INREG32(&gpon_mac_reg_BASE->G_GBL_CFG) // 4004
#define G_INT_STATUS                                           INREG32(&gpon_mac_reg_BASE->G_INT_STATUS) // 4008
#define G_INT_ENABLE                                           INREG32(&gpon_mac_reg_BASE->G_INT_ENABLE) // 400C
#define G_TCONT_ID_0_1                                         INREG32(&gpon_mac_reg_BASE->G_TCONT_ID_0_1) // 4020
